["BETHESDA, Md.", "(AP) — Researchers hooked Zach Ault to medical monitors as he slowly climbed onto a gym bike.", "An invisible disease is sidelining this once avid athlete and he knew the simple exercise would wipe him out -- but Ault was pedaling for science.", "Chronic fatigue syndrome is one of medicine’s most vexing mysteries.", "Now doctors at the National Institutes of Health are using volunteers like Ault for a unique study that pushes their limits in search of what’s stealing all their energy.", "“I’ve tried to exercise my way out of this multiple times and I’ve put myself in deeper pits every time,” said Ault, 36, of Paducah, Kentucky, as he began a nearly two-week stint at the research-only hospital outside the nation’s capital.", "“Chronic fatigue is kind of like they took the stopper out of the energy reserve tank,” and no amount of sleep replenishes it, he said.", "Up to 2.5 million Americans are estimated to have what is known officially as ME/CFS -- it stands for “myalgic encephalomyelitis/chronic fatigue syndrome.” Its hallmark is profound fatigue, lasting more than six months, that’s made even worse by any type of exertion.", "Among other symptoms, patients also tend to have difficulty staying upright or cognitive trouble often described as a “brain fog.” Many go undiagnosed, misdiagnosed or dismissed by skeptical doctors.", "Decades after it was first recognized, scientists don’t know what causes it.", "There are no approved treatments, or even tests to help diagnosis -- and no way to predict who will recover and who will have a severe case that leaves them debilitated, even bed-bound, for years.", "“The ignorance about the condition just vastly dwarfs what we know about it,” said Dr. Walter Koroshetz, director of NIH’s National Institute for Neurological Disorders and Stroke, which is leading the research.", "The NIH has more than doubled funding -- to more than $14 million -- for scientists around the country to unravel the biology of ME/CFS since 2015, when the influential Institute of Medicine decried “a paucity of research.”  Part of the trouble is that varied symptoms make it hard to compare patients.", "A patient advocacy group called Solve ME/CFS Initiative is preparing to open a registry where patients can send in medical information and blood and saliva samples to help scientists expand research.", "And illustrating the desperation for answers, nearly 500 patients have called seeking to enroll in NIH’s own study that is putting a few dozen under the microscope, with a barrage of sophisticated tests few hospitals can offer under one roof.", "Like many such patients, Ault’s disease struck following a run-of-the-mill infection in 2017.", "He’d been training for a half-marathon but after a little time off to recover, he tried to resume his runs and couldn’t.", "His diagnosis came after months of tests for other explanations.", "“His body had literally hijacked him and it wasn’t going to allow him to push through,” said Anne Ault, his wife.", "Ault, a father of three, was missing his kids’ sporting and school activities, even his nightly wrestle with his young son.", "He had to cut back his job, in the ministry, to half-days.", "When 16 hours of sleep a day made no difference, his wife, a pharmacist, hunted research opportunities.", "Ault fit the bill for the NIH study, which is focusing on people who came down with the disease after an infection, of any sort, within five years.", "That initial infection is long gone but maybe, the body’s normal reactions to illness went into a destructive tailspin.", "“You’re really capturing the disease at a specific point in time,” in its crucial early stages, said Sadie Whittaker, scientific director for the Solve ME/CFS Initiative.", "“No one has studied such a very specific population to such depth before.” There are some clues.", "Earlier studies have found brain inflammation in patients, and nervous system abnormalities that might explain why they feel worse upright than lying down.", "The immune system seems to be on chronic alert.", "Then there’s the energy drain.", "Just last month, Cornell University researchers reported that patients’ key immune cells don’t make energy properly.", "The NIH study is looking for more clues.", "It starts with a week-plus hospitalization for blood and genetic tests, brain scans, a spinal tap, sleep tests, a check of gut bacteria.", "Scientists pore over the results before deciding who to invite back for a longer and more rigorous visit.", "“Go as far as you can, work as hard as you can,” NIH physical therapist Bart Drinkard told Ault as he climbed onto the exercise bike.", "Cells, in particular little factories inside cells called mitochondria, use oxygen and nutrients to create energy.", "While Ault pedals, scientists can measure how his leg muscles use oxygen, and see if that’s different than in a healthy person.", "Afterward, doctors fit a special cap on Ault to track electrical activity in his brain, and then sent him to spend the night in an air-tight chamber.", "Pipes draw out the room’s air for analysis.", "How much oxygen is used and carbon dioxide is produced tells how much energy Ault is using, minute by minute.", "“We can calculate every molecule.", "It’s the cleanest air we have in the hospital,” said NIH’s Kong Chen, a metabolism specialist.", "“We’re figuring out how his body adjusts to an exercise load, or a stress load.” Researchers are clear: The study doesn’t offer any treatments, although the hope is to find targets to eventually develop some.", "But Ault says it did help to learn about the disease and tricks to conserve his energy and pace himself “so I can try to stay as healthy as possible without such bad consequences.” “It’s hard not knowing if I’m going to recover, if or when,” he said."]