["NEW YORK (AP) —  Researchers on Wednesday reported the largest-ever one-year decline in the U.S. cancer death rate, a drop they credited to advances in lung-tumor treatments.", "The overall cancer death rate has been falling about 1.5% a year since 1991.", "It fell 2.2% from 2016 to 2017, according to the new American Cancer Society report.", "That’s the largest drop ever seen in national cancer statistics going back to 1930, said Rebecca Siegel, the lead author.", "“It’s absolutely driven by lung cancer,” which accounts for about a quarter of all cancer deaths, she said.", "Take lung cancer out of the mix, and the 2017 rate drop is 1.4%, she added.", "Government researchers previously reported a slightly lower drop in the cancer death rate for the same period.", "But the Cancer Society calculates the death rate differently, and on Wednesday said the decline was larger — and record-setting.", "Most lung cancer cases are tied to smoking, and decades of declining smoking rates led to falling rates of lung cancer illnesses and deaths.", "But the drop in deaths seems to have been accelerated by recent lung cancer treatment advances, Siegel said.", "Experts mainly credit advances in treatment.", "Topping the list are refinements in surgery, better diagnostic scanning, and more precise use of radiation.", "They also celebrate the impact of newer drugs.", "Genetic testing can now identify specific cancer cell mutations, which allow more targeted therapy using newer pharmaceuticals that are a step beyond traditional chemotherapy.", "“It’s an exciting time,” said Dr. Jyoti Patel, a Northwestern University lung cancer expert.", "Even patients with late-stage cancers are surviving for several years — rather than months — after treatment starts, she said.", "“That was very, very uncommon a decade ago,” she said.", "New immunotherapy drugs could accelerate the death rate decline, Patel said.", "Cancer Society researchers also found: — The overall cancer death rate fell by nearly 30% from 1991 through 2017.", "— Death rates from one type of skin cancer dropped even more dramatically than lung cancer — falling 7% a year recently.", "That decline in melanoma patients is attributed to drugs that came on the market about nine years ago.", "— Declines in the death rates from prostate, breast and colon cancer are slowing, for a range of reasons.", "— The rising liver cancer death rate seems to have leveled off somewhat.", "That may be related to better treatment of hepatitis C infections, which are tied to about 25% of liver cancer cases, Siegel said."]