["CAMBRIDGE, Mass.", "&amp; OSAKA, Japan--(BUSINESS WIRE)--Jan 14, 2020-- Takeda Pharmaceutical Company Limited ( <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.takeda.com%2Finvestors%2F&amp;esheet=52158194&amp;newsitemid=20200114005309&amp;lan=en-US&amp;anchor=TOKYO%3A4502%2FNYSE%3ATAK&amp;index=1&amp;md5=8578dda80c4afc735d21377923dad6de\" rel=\"noopener noreferrer\" target=\"_blank\" “Last year was an important and successful year for Takeda as we accelerated our transformation to become a leading global biopharmaceutical company,” said Mr. Weber.", "“Our commitment to bringing better health and a brighter future to patients worldwide continues as we expand our global brands and advance our next-generation pipeline, driving sustainable growth.", "We also recognize that supporting our patients means we must commit to work on behalf of the broader global community – and one way to do this is by accelerating our environmental efforts.” <em As highlighted at its recent R&amp;D Investor Day event in November 2019, Takeda continues to generate significant opportunities through new indications and geographic expansion of its 14 global brands.", "By cultivating the best science through its research and development engine, comprised of internal capabilities and external partnerships, Takeda is quickly advancing a steady stream of next-generation therapies designed to provide transformative or curative potential for targeted populations with high unmet medical needs in its core therapeutic areas of oncology, rare diseases, neuroscience and gastroenterology.", "Over the next several years, Takeda’s pipeline is projected to deliver value with a focus on the potential launches of 12 unique new molecular entities (NMEs) in 14 indications, which represent best-in-class or first-in-class therapies to advance patient standard of care, and that have the potential to deliver more than $10 billion (USD) in aggregate peak sales.", "Takeda is confident in its ability to execute in the near-term and achieve sustainable growth through 2024 and beyond, with its portfolio of 14 global brands and additional anticipated product launches intended to fuel its growth trajectory while its next-generation platforms mature.", "<em     <em Takeda is committed to maintaining investment grade credit ratings and remains on track towards its target of 2x Net Debt/adjusted EBITDA ratio within the fiscal years ending March 2022 to March 2024, with rapid de-leveraging driven by strong cash flow and proceeds from non-core asset divestitures.", "In the first six months of FY19, Takeda reduced its Net Debt/adjusted EBITDA ratio from 4.7x to 3.9x.", "In addition, four non-core asset divestitures were announced that, together with other potential divestments, are expected to reach $10 billion (USD).", "Through expected cost synergies from the acquisition of Shire that are expected to reach a run rate of approximately $2 billion (USD) annually and operating expenditure efficiencies, Takeda is also driving towards its target of a mid-30% underlying core operating profit margin within the fiscal years ending March 2022 through March 2024.", "Takeda remains committed to shareholder returns with a well-established dividend policy of 180 yen per share annually.", "<em Recognizing that climate change poses a risk to human health, including the spread of infectious diseases, Takeda has made environmental efforts a priority.", "To date, Takeda has met and exceeded its previously established 2020 environmental goals ahead of schedule, including reducing its CO2 emissions by 33.7% compared to 2005 levels.", "Furthering the Company’s commitment to the environment, today Takeda will unveil its new 2040 targets to achieve carbon neutrality across its value chain.", "Takeda intends to do this by eliminating all greenhouse gas (GHG) emissions from its operations (Scopes 1 and 2), working with its suppliers to significantly reduce their emissions (Scope 3), and addressing remaining Scope 3 emissions through verified carbon offsets.", "Beginning with FY19 GHG emissions, the Company commits to carbon neutrality (Scopes 1, 2, and 3) through the purchase of renewable energy and verified carbon offsets, while simultaneously working to reduce emissions from its operations and suppliers.", "In addition to Takeda’s environmental efforts, its overall commitment to ESG – including the Access to Medicines Strategy and Global Corporate Social Responsibility (CSR) Program – has been recognized by multiple benchmark ESG indices.", "Since 2014, Takeda has risen 15 spots to No.", "5 in the latest Access to Medicines Index, which measures commitment and achievements in the field of patient access to medicine and treatment globally.", "Takeda is proud to have provided access to innovative and potentially life-saving treatments to more than 125,000 patients.", "In addition, its CSR Program has committed over $100 million (USD) to organizations that work to prevent diseases and improve health outcomes around the world.", "Takeda is proud that employees are engaged and select the organizations that the CSR Program supports.", "Takeda’s 2019 <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.takeda.com%2Fcorporate-responsibility%2FSustainable-Value-Report%2F&amp;esheet=52158194&amp;newsitemid=20200114005309&amp;lan=en-US&amp;anchor=Sustainable+Value+Report&amp;index=2&amp;md5=e765fbd3f7e0d761c71f1718aee0e262\" rel=\"noopener noreferrer\" target=\"_blank\" Slides from the J.P. Morgan Healthcare Conference presentation, and a link to the audio webcast, may be accessed on Takeda’s website at: <br/ <em <em The companies in which Takeda directly and indirectly owns investments are separate entities.", "In this press release, “Takeda” is sometimes used for convenience where references are made to Takeda and its subsidiaries in general.", "Likewise, the words “we”, “us” and “our” are also used to refer to subsidiaries in general or to those who work for them.", "These expressions are also used where no useful purpose is served by identifying the particular company or companies.", "<em <em Further information on certain of Takeda’s Non-IFRS measures is posted on Takeda’s investor relations website at <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.takeda.com%2Finvestors%2Freports%2Fquarterly-announcements%2Fquarterly-announcements-2019%2F&amp;esheet=52158194&amp;newsitemid=20200114005309&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.takeda.com%2Finvestors%2Freports%2Fquarterly-announcements%2Fquarterly-announcements-2019%2F&amp;index=8&amp;md5=72bb5c6fbcc6bcf372e9823afa5bdc21\" rel=\"noopener noreferrer\" target=\"_blank\"  <media class=\"inline:reference\" media-type=\"image\" View source version on businesswire.com:<a class=\"\" href=\"https://www.businesswire.com/news/home/20200114005309/en/\" rel=\"noopener noreferrer\" target=\"_blank\"     CONTACT: Japanese Media Kazumi Kobayashi Kazumi.Kobayashi@Takeda.com +81 (0) 3-3278-2095Media outside of Japan Katie Joyce Katie.Joyce@Takeda.com              +1-617-678-9370 KEYWORD: NORTH AMERICA UNITED STATES ASIA PACIFIC CHINA JAPAN CALIFORNIA \r\n     INDUSTRY KEYWORD: BIOTECHNOLOGY PHARMACEUTICAL ENVIRONMENT FINANCE ONCOLOGY HEALTH PROFESSIONAL SERVICES CLINICAL TRIALS \r\n     SOURCE: Takeda Pharmaceutical Company Limited\r\n Copyright Business Wire 2020."]