["NEW YORK (AP) — Three U.S. airports will screen passengers arriving from central China for a new virus that has sickened dozens, killed two and prompted worries about an international outbreak, health officials said Friday.", "Centers for Disease Control and Prevention officials say they will begin taking temperatures and asking about symptoms of passengers at three U.S. airports who traveled from the outbreak city of Wuhan.", "Officials estimate roughly 5,000 passengers will go through the process in the next couple of weeks at New York City’s Kennedy airport and the Los Angeles and San Francisco airports.", "The first direct flight was expected Friday night at Kennedy, and the next expected Saturday morning in San Francisco.", "Doctors began seeing a new type of viral pneumonia — fever, cough, difficulty breathing — in people who worked at or visited a food market in the suburbs of Wuhan late last month.", "More than 45 cases of the newly identified coronavirus have been confirmed in Asia, most of them in Wuhan, including two deaths — at least one involving a previous medical condition.", "Officials have said it probably spread from animals to people but haven’t been able to rule out the possibility that it spreads from person to person.", "So far, the risk to the American public is deemed to be low, but the CDC wants to be prepared and is taking precautions, the CDC’s Dr. Martin Cetron said.", "“The earlier we detect a case, the better we can protect the public, and the more we can understand about this virus and its risk for spread,” he said in a call with reporters.", "It’s always possible a virus can mutate to become more dangerous.", "It’s also likely that more cases will spring up around the world, including at least one at some point in the United States, said another CDC official, Dr. Nancy Messonnier.", "The CDC is sending in 100 staffers to handle the airport screenings.", "Passengers who seem like they might be infected will undergo testing for flu or other possible causes.", "The plan is to place them in isolation at a nearby hospital until doctors know what they’re dealing with, to prevent possible spread of the new virus.", "Specialized testing for the virus can take a day for results, CDC officials said.", "At least a half-dozen countries in Asia have started screening incoming airline passengers from central China.", "The list includes Thailand and Japan, which both have reported cases of the disease in people who had come from Wuhan.", "Travel is unusually heavy right now as people take trips to and from China to celebrate the Lunar New Year.", "The CDC said the airport screenings are part of an effort to better detect and prevent the virus from the same family of bugs that caused an international outbreaks of SARS and MERS that began in 2002 and 2012.", "The CDC did not screen incoming passengers during those outbreaks, and some public health experts questioned whether they should do so now.", "“It’s not a particularly effective intervention, and it potentially offers a false sense of security,” said Dr. Kamran Khan, a University of Toronto researcher who has studied airport screenings during the SARS and Ebola outbreaks.", "Screeners likely will flag a lot of people with other germs — it is flu season — while missing infections from the new virus.", "Experts believe it may take up to two weeks between the time someone is infected and when they come down with a fever and other symptoms.", "The only other time the CDC has done airport screenings was in 2014, when health officials screened thousands of passengers from three West African countries for Ebola but detected no illnesses.", "In fact, one passenger who was infected but had no symptoms passed through the screenings and then developed symptoms after arriving in the United States.", "Some have argued measures like this have less to do with good science than with politicians hoping to convince the public that the government is doing something to protect them.", "Cetron rejected that notion.", "“There’s widespread consensus we should be doing this now,” among both political appointees and government scientists, he said.", "Passengers who don’t have symptoms will be handed cards that tell who to contact for health care if they develop symptoms later.", "That’s important, Khan said.", "“Educating travelers about the illness and letting them know what to do if they become sick after they leave the airport can be very helpful” because it can speed up proper diagnosis, treatment and isolation precautions, he said.", "Health authorities identified the bug this month as a new type of coronavirus.", "Coronaviruses are a large family of viruses, some of which cause the common cold; others found in bats, camels and other animals have evolved into more severe illnesses.", "SARS, or severe acute respiratory syndrome, belongs to the coronavirus family, but Chinese state media say the illness in Wuhan is different from coronaviruses that have been identified in the past.", "Earlier laboratory tests ruled out SARS and MERS — Middle East respiratory syndrome — as well as influenza, bird flu, adenovirus and other common lung-infecting germs.", "CDC officials said Friday that they are not certain if China has begun screening passengers before they board airplanes to travel abroad, but it’s been discussed.", "The New York and San Francisco airports each receive three direct flights from Wuhan each week, Cetron said.", "Los Angeles International gets significant numbers of passengers who start their journeys in Wuhan but change planes in Beijing.", "___ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education."]