["LAS VEGAS--(BUSINESS WIRE)--Jan 6, 2020-- Breakthroughs in artificial intelligence (AI) that pave the way for autonomous driving.", "A new era of mobile computing innovation.", "The future of immersive sports and entertainment.", "Intel demonstrated all of these and more today at CES 2020, showcasing how the company is infusing intelligence across the cloud, network, edge and PC, and driving positive impact for people, business and society.", "This press release features multimedia.", "View the full release here: <a class=\"\" href=\"https://www.businesswire.com/news/home/20200106006026/en/\" rel=\"noopener noreferrer\" target=\"_blank\"   <media class=\"inline:reference\" media-type=\"image\" At CES 2020 in Las Vegas, Intel previewed a foldable OLED display form factor, code-named “Horseshoe Bend.” Based on Intel’s upcoming Tiger Lake mobile processors, the design is similar in size to a 12-inch laptop with a folding touchscreen display that can be opened up to more than 17 inches.", "(Credit: Walden Kirsch/Intel Corporation) Intel CEO Bob Swan kicked off today’s news conference by sharing updates from its Mobileye business, including a <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fyoutu.be%2F-kNUVM8s0nc&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=demonstration&amp;index=1&amp;md5=50ec149055b520ead942414bb3e69a0f\" rel=\"noopener noreferrer\" target=\"_blank\" Swan also highlighted <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fnewsroom.intel.com%2Fnews%2Famerican-red-cross-intel-use-ai-disaster-preparedness%2F&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=Intel%27s+work+with+the+American+Red+Cross+and+its+Missing+Maps+project&amp;index=3&amp;md5=5903ec4bd9b35cd7f91aec2474f47699\" rel=\"noopener noreferrer\" target=\"_blank\"   “At Intel, our ambition is to help customers make the most of technology inflections like AI, 5G and the intelligent edge so that together we can enrich lives and shape the world for decades to come.", "As we highlighted today, our drive to infuse intelligence into every aspect of computing can have positive impact at unprecedented scale,” Swan said.", "<em Mobile computing was an area of emphasis, as Intel made announcements spanning new products, partnerships and exciting platform-level innovations that will transform the way people focus, create and engage.", "Intel Executive Vice President Gregory Bryant announced the following:     <em The data center is the force that delivers intelligence to businesses around the world and Intel Xeon Scalable processors continue to be the foundation of the data center.", "Intel Executive Vice President Navin Shenoy announced that 3rd Generation Intel Xeon Scalable processors, coming in the first half of 2020, will include new Intel® DL Boost extensions for built-in AI training acceleration, providing up to a 60% increase in training performance over the previous family.", "Shenoy highlighted several ways Intel is threading intelligence into data platforms across cloud, network and edge and how this is transforming sports and entertainment:     More information on all of these announcements, including visual assets from the event, is available in the <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fnewsroom.intel.com%2Fpress-kits%2F2020-ces%2F&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=CES+press+kit+on+the+Intel+Newsroom&amp;index=4&amp;md5=656ce61cc1d18e5ca7fd7b0fbcae7ef7\" rel=\"noopener noreferrer\" target=\"_blank\" <em Intel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations.", "The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between.", "Find more information about Intel at <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fnewsroom.intel.com&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=newsroom.intel.com&amp;index=5&amp;md5=204870aee7a0ecc6bd305f74175e62fc\" rel=\"noopener noreferrer\" target=\"_blank\" <em Statements in this news summary that refer to future plans and expectations, including with respect to Intel’s future products and the expected availability and benefits of such products, are forward-looking statements that involve a number of risks and uncertainties.", "Words such as “anticipates,” “expects,” “intends,” “goals,” “plans,” “believes,” “seeks,” “estimates,” “continues,” “may,” “will,” “would,” “should,” “could,” and variations of such words and similar expressions are intended to identify such forward-looking statements.", "Statements that refer to or are based on estimates, forecasts, projections, uncertain events or assumptions, including statements relating to total addressable market (TAM) or market opportunity and anticipated trends in our businesses or the markets relevant to them, also identify forward-looking statements.", "Such statements are based on the company’s current expectations and involve many risks and uncertainties that could cause actual results to differ materially from those expressed or implied in these forward-looking statements.", "Important factors that could cause actual results to differ materially from the company’s expectations are set forth in Intel’s earnings release dated October 25, 2018, which is included as an exhibit to Intel’s Form 8-K furnished to the SEC on such date.", "Additional information regarding these and other factors that could affect Intel’s results is included in Intel’s SEC filings, including the company’s most recent reports on Forms 10-K and 10-Q.", "Copies of Intel’s Form 10-K, 10-Q and 8-K reports may be obtained by visiting our Investor Relations website at <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.intc.com&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=www.intc.com&amp;index=7&amp;md5=f255dda582911cfd9fd23b11b8f2633f\" rel=\"noopener noreferrer\" target=\"_blank\" Software and workloads used in performance tests may have been optimized for performance only on Intel microprocessors.", "Performance tests, such as SYSmark and MobileMark, are measured using specific computer systems, components, software, operations and functions.", "Any change to any of those factors may cause the results to vary.", "You should consult other information and performance tests to assist you in fully evaluating your contemplated purchases, including the performance of that product when combined with other products.", "For more complete information visit <a class=\"\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.intel.com%2Fbenchmarks&amp;esheet=52154089&amp;newsitemid=20200106006026&amp;lan=en-US&amp;anchor=www.intel.com%2Fbenchmarks&amp;index=9&amp;md5=df41de9546a1fe73137375ede6807aae\" rel=\"noopener noreferrer\" target=\"_blank\" © Intel Corporation.", "Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries.", "Other names and brands may be claimed as the property of others.", "1 -- Based on Intel testing and configurations  <media class=\"inline:reference\" media-type=\"image\" View source version on businesswire.com:<a class=\"\" href=\"https://www.businesswire.com/news/home/20200106006026/en/\" rel=\"noopener noreferrer\" target=\"_blank\"     CONTACT: Farm Saechou (916) 377-9577              farm.p.saechou@intel.com KEYWORD: UNITED STATES NORTH AMERICA CALIFORNIA NEVADA \r\n     INDUSTRY KEYWORD: TECHNOLOGY CONSUMER ELECTRONICS DATA MANAGEMENT INTERNET NETWORKS SOFTWARE AUDIO/VIDEO SEMICONDUCTOR MANUFACTURING AUTOMOTIVE MANUFACTURING ALTERNATIVE VEHICLES/FUELS AUTOMOTIVE \r\n     SOURCE: Intel Corporation\r\n Copyright Business Wire 2020."]