["BEIJING (AP) — The Chinese paddlefish’s sharp, protruding snout made it one of the largest freshwater species in the world.", "Since scientists declared it extinct in a research paper published last week, Chinese internet users and media outlets have been paying tribute to the hefty creature.", "“It’s farewell at first sight,” said China Youth Daily, noting that many were lamentably unfamiliar with the paddlefish before learning of its demise.", "Users shared similar sentiments on the Twitter-like Weibo platform.", "So named for its distinctive shape, the Chinese paddlefish, or Chinese swordfish, had a lineage dating back at least 34 million years, scientists believe.", "It could grow as long as 7 meters (23 feet), but in the end, it couldn’t survive the overfishing, habitat fragmentation and loss of biodiversity in its native Yangtze River, <a class=\"\" href=\"https://www.sciencedirect.com/science/article/pii/S0048969719362382#!\"", "rel=\"noopener noreferrer\" target=\"_blank\" “As no individuals exist in captivity, and no living tissues are conserved for potential resurrection, the fish should be considered extinct,” the paper said, pointing to criteria for inclusion on the International Union for Conservation of Nature’s (IUCN) Red List.", "The paper was authored by scientists from the Chinese Academy of Fishery Sciences, the University of Kent and the University of South Bohemia in the Czech Republic.", "The paper said since the late 1970s Chinese paddlefish populations declined drastically.", "The decline corresponded with major dam construction in the Yangtze.", "During that time, the Gezhouba Dam was built on the main stream of the river, and the opening of the <a class=\"\" href=\"/87bbc3ed724857e85236dc5c2a3e5b41\" A survey in 2017 and 2018 found 332 fish species in the Yangtze, but not a single specimen of Chinese paddlefish.", "The researchers estimate that the fish became extinct some time between 2005 and 2010.", "“The extinction of the paddlefish is a huge loss and reflects the critical status of the Yangtze River ecosystem,” said Pan Wenjing, a forest and oceans manager for Greenpeace East Asia.", "“The ecology of the Yangtze River is close to collapse due to human activity in past decades,” Pan said.", "“China has launched its campaign trying to recover the Yangtze River’s environment, and some ambitious policies have been introduced, such as the 10-year ban on fishing activity.” Users on Weibo expressed the wish that a Chinese paddlefish might still resurface in the river.", "“Every time I see the news of another species going extinct, my heart starts to throb,” wrote one science blogger."]