["CAPE CANAVERAL, Fla. (AP) — Spacewalking astronauts had to make do with fewer lights and camera views from one helmet Wednesday while performing critical battery work outside the International Space Station.", "It was the second pairing of NASA’s Jessica Meir and Christina Koch outside the orbiting lab.", "Last October, they teamed up for the world’s first all-female spacewalk.", "The women were just getting started on battery replacements when Koch’s camera and light unit came loose and they couldn’t get it back on her helmet.", "Mission Control told them to just take it off, rather than waste any more time, and continue the spacewalk.", "“Just be careful,” Mission Control urged Koch.", "“You’re missing that additional protection.” Koch later assured flight controllers that she had enough good light.", "The astronauts ended up completing all their tasks and even jumped ahead, putting two new batteries in and pulling four old ones out.", "The spacewalk lasted 7 1/2 hours.", "“It was truly amazing for Christina and me to be back out here today,” said Meir.", "She also welcomed the 13 new astronauts who graduated last week, reading out their first names.", "Meir and Koch have one last spacewalk next Monday.", "That would make a total of five spacewalks for this latest effort to install six new batteries and remove 12 old ones.", "NASA is in the midst of replacing 48 decades-old nickel-hydrogen batteries outside the sprawling space station with more powerful, longer-lasting lithium-ion batteries, of which only half as many are needed.", "The batteries are part of the station’s solar power network, keeping everything running when the outpost is on the night side of Earth.", "The final batch of new batteries should be launched this spring.", "Koch went out with a male colleague twice last October to install three new batteries.", "But a charging unit then failed, prompting the need that month for unexpected repairs by Koch and Meir.", "Engineers now believe the charger got too cold in the extreme temperatures of space.", "The solution: exposing the chargers to the sun as much as possible during the battery work.", "Koch is just three weeks away from ending an 11-month space mission, the longest ever by a woman.", "She’s been living 250 miles (400 kilometers) above Earth since last March.", "Meir arrived at the space station in September."]