["We've been warned about the cold snap heading to Calgary, but now that it's here, we're left with how we can beat it.", "Davis Leong, supervisor of daily programs at Telus Spark, shares the science behind feeling cold and best practices to keep warm.", "He told the <a href=\"https://www.cbc.ca/listen/live-radio/1-5-calgary-eyeopener\" \"One of the ways that your body can do that is by breaking its chemical energy down and flexing your muscles really fast and turning that chemical energy into kinetic energy as heat,\" he explained.", "In other words, Leong says your body is shivering.", "\"Typically, you start shivering when you've been outside for extended periods of time and you're really quite cold,\" Leong said.", "He adds that in order to avoid getting too cold, wear heavy wool socks because wool has the natural ability to adjust your body temperature — just make sure to change into dry ones once you get inside.", "\"Feet are always sweating as well, so that sweat is going to build up in your socks,\" he said.", "Since that's the case, Leong advises to be careful on how much you layer clothes on the rest of your body.", "\"Sweat is really the enemy of staying warm in the wintertime,\" Leong said.", "\"You don't want to get so warm that you're sweating all the time because you're going to lose more heat to the atmosphere that way.\"", "He says it's important to make sure your head is warm, too.", "\"So when mom tells you to put a tuque on in the morning, she is right because it might be the only piece of exposed skin you have left — and that's what's radiating most of your heat to the environment,\" he said.", "Once you escape the cold and change into some warm pyjamas, there's some hacks you can use to keep your home warm as well.", "\"One of the easy ones is to keep your curtains open during the day to get kind of that free radiant energy from the sun, and then to close them at night because that will prevent heat loss back out through your windows,\" Leong said.", "Another simple trick is rather than bundling up and planting yourself on your couch, try getting up every few minutes and moving around.", "\"It's actually getting your blood flowing and allowing the heat to move around your body a little bit more,\" he said."]