["Liberal cabinet ministers began meetings in Winnipeg today to set parliamentary priorities and strategize for what's expected to be a challenging winter session for the minority government.", "The three-day retreat will focus on themes laid out in the fall throne speech: growing the economy and the middle class, tackling climate change, and building healthy and safe communities, including new gun control measures and continued efforts to promote reconciliation with Indigenous peoples.", "One of the urgent orders of business is the federal response to the massive blizzard in Newfoundland and Labrador, where a state of emergency was declared in St. John's and several other municipalities.", "On Saturday, <a href=\"https://www.cbc.ca/news/canada/newfoundland-labrador/newfoundland-blizzard-1.5432023\" Governing without a majority means the government must get at least one of the opposition parties on board to pass legislation and the upcoming budget.", "On Sunday, Finance Minister Bill Morneau acknowledged there will be \"some differences\" in how the government drafts its economic plan.", "\"Importantly, we will have to, as we get to Parliament, make sure that we are talking with all of the other parties.", "That's been a priority we've had over previous years — I'm sure it will be more robust this year,\" he said.", "As the nation continues to grieve the loss of 57 Canadians killed in the Flight PS752 airline disaster in Iran, mounting tensions in the Middle East and other global affairs will also be high on the agenda.", "But domestic pressures are paramount, and the chosen location of the retreat is both symbolic and politically strategic.", "\"It is a city in the West where they should have done better in the last election and they have the potential to do better in the next election — that we know will be probably sooner rather than later,\" said Liberal commentator Greg MacEachern.", "\"Going to Manitoba makes more sense than going to Alberta.", "There's still a lot of active issues in Alberta, which might have obscured any messages the government wants to get out.\"", "The Liberals were shut out of Alberta and Saskatchewan in the Oct. 21 election, reflecting a strong dissatisfaction in the region over the federal carbon tax and slow progress on building a pipeline.", "While Manitoba Premier Brian Pallister may not be the Liberal government's biggest fan, MacEachern said, he has demonstrated a tendency to focus on areas of common interest rather than making partisan attacks as other premiers, such as Alberta's Jason Kenney and Saskatchewan's Scott Moe, have done.", "In an attempt to heal the regional divisions, Prime Minister Justin Trudeau appointed Chrystia Freeland, one of his top-performing ministers, to take on the intergovernmental affairs file in his Nov. 20 cabinet shuffle.", "To further demonstrate the government's commitment to addressing regional discontent, Trudeau also named Freeland deputy prime minister and tasked her with working with all ministers to restore relations with the West.", "After his Liberals were reduced to a minority government, Trudeau promised to adopt a more collaborative approach in working with both the provincial premiers and the federal opposition parties.", "The weeks and months ahead will test that resolve and the government's ability to navigate the new reality to pass legislation and a federal budget.", "\"This session for them will be where the rubber hits the road, where you have to look at things, very frankly, through a political lens,\" MacEachern said.", "\"Who else is going to support this?", "You can have the best ideas in the world, but in a minority parliament, if it doesn't appeal to enough people in another party, they're going to go nowhere.\"", "MacEachern said outside the work of the House of Commons, ministers must grapple with external issues: the raging bushfires in Australia, rising tensions with Iran and how to navigate Canada-U.S. relations in an election year, including ratifying a new trilateral trade deal with the U.S. and Mexico.", "Daniel Béland, a political science professor and director of the McGill Institute for the Study of Canada, believes getting \"NAFTA 2.0\" — also called CUSMA (the Canada-U.S.-Mexico Agreement on trade) past the finish line must be a top economic priority for the government.", "He said there's a danger in delay, because U.S. President Donald Trump could respond negatively if he becomes impatient.", "\"That's the most important issue by far in terms of our international footprint because our economic relationship with the U.S is so fundamental to our development, to our economic well-being,\" he said.", "Béland agrees that Trudeau and his ministers will need to adopt a more conciliatory approach to governing in order to pass that trade deal and other pieces of legislation, but said the Liberals likely have some breathing room before the next campaign.", "The Bloc Québécois and NDP don't have the desire or money to fight a snap election, and the Conservatives are in the throes of a leadership race to replace Andrew Scheer, he said.", "\"Right now I'm not sure who has the incentive to have an early election, who could pull the trigger,\" Béland said.", "Conservative House Leader Candice Bergen expects the Liberals will capitalize on the fact her party is dealing with a leadership race, but warned that the opposition will work to hold the government to account on key files, including the new NAFTA.", "She said agricultural and other sectors negatively impacted by the deal must be properly compensated.", "Bergen said selecting Winnipeg as the venue for the cabinet retreat is likely meant to send a signal that the Liberals are listening and willing to address the issues driving western alienation.", "But to date, she said Trudeau has shown arrogance and a superficial acknowledgement of the region's pressing concerns.", "\"That will be a very important test that these Liberals are facing.", "And do they have the capacity to pass it?", "I don't know,\" she said.", "\"I don't know if they understand the challenges that western Canadians are going through and if some of their political ideology in terms of anti-pipeline sentiment in their caucus and cabinet, anti-development sentiment in their caucus and cabinet, can overshadow the need for them to put the interests of all Canadians first.\"", "NDP house leader Peter Julian said as the government prepares for its upcoming budget, New Democrats will be pressing for issues that will help Canadians, such as pharmacare and a $15 federal minimum wage and dental care for those who need it most.", "\"If all the Liberals want is to stay in power, they can keep counting on the Conservatives or the Bloc for support\" Julian said in a statement to CBC.", "\"But, if they actually want to help people, they can work with us, and we can deliver what Canadians need to help with the problems they face every day.\"", "Ministers are expected to hear from several guest speakers, including a panel on the state of the economy and the middle class with Canada's chief statistician Anil Arora and economists Armine Yalnizyan and Kevin Milligan.", "Talks on climate change will include implementing campaign commitments around electric buses, home retrofits and tree planting.", "Ministers will hold discussions with Andrew Leach, an energy and climate expert at the University of Alberta, and Katharine Hayhoe, a Canadian atmospheric expert at Texas Tech University.", "There will also be an update on the Trans Mountain pipeline, including engagement efforts with Indigenous peoples.", "Guest speakers on that issue are Ian Anderson, CEO of Trans Mountain Corporation, William Downe, chair of the board for Trans Mountain Corporation, and Linda Coady, who was named last fall to lead Indigenous engagement on equity for the project.", "Trudeau is <a href=\"https://www.cbc.ca/news/canada/manitoba/prome-minister-trudeau-winnipeg-bowman-pallister-meeting-1.5431597\" The agenda also includes discussions on health care and a panel of local representatives on regional development and economic competitiveness.", "Add some “good” to your morning and evening.", "A variety of newsletters you'll love, delivered straight to you.", "Thank you for subscribing to <!-- -- Happy reading!"]