["Vancouver Island University's fisheries facility is being temporarily decommissioned after an incident just before Christmas killed 377 trout being used for teaching and research.", "\"It was an accident that happened overnight in mid-December,\" said Nicole Vaugeois, the associate vice-president of research at the university in Nanaimo.", "A statement says the deaths were caused by a series of \"mechanical and human\" errors.", "\"I can't go into too many details out of respect for the privacy of our students and employees,\" said Vaugeois.", "The school's <a href=\"https://scitech.viu.ca/fisheries-aquaculture\" Jessica Hopkins, a former fisheries student at VIU, said in a message that the trout farm is \"run by students.\"", "She noted  the water in the trout tanks is first filtered by the school's hydroponic farm and is then fed from the trout farm into a shellfish farm.", "Due to a longstanding mutual aid agreement between the school and the federal<a href=\"http://www.pac.dfo-mpo.gc.ca/science/facilities-installations/index-eng.html#pbs\" Vaugeois said the coordinated move was \"our chance to rectify deficiencies in the facilities and training that were identified as a result of this incident.\"", "Vaugeois said the move was \"a whole lot of work,\" listing transportation permits that had to be made, approvals by animal care committees from the school and the district fisheries office, as well as health checks by a veterinarian.", "The fish were then all transported in small tanks.", "The CBC reached out to the Pacific Biological Station for comment on the state of the fish, but did not hear back.", "Pierre Verreault, the executive director of the<a href=\"https://www.ccac.ca/en/about-the-ccac/\" \"These big aquatic systems often can have failures\" due to how mechanically complex they are, he said, adding he could not comment on the errors leading up to the accident due to confidentiality matters.", "\"It's often a series of mishaps that lead to [problems].\"", "Verrault said the council has lately noticed more fish being used for research, which elevates risks to the health and safety of these fish populations.", "He noted the council often reviews its risk policies to make sure they're up to date.", "Vaugeois said the farm will be decommissioned to assess \"what investments need to be made to our current facility\" over the next month, adding that faculty will examine how many fish are actually needed for teaching and research, and whether the facilities need to be upgraded to accommodate them.", "She said she hopes the building will reopen as soon as possible.", "Adam van der Zwan is a journalist based in Victoria, British Columbia.", "You can send him a news tip at adam.van.der.zwan@cbc.ca."]