["Boxers or briefs?", "Why not something even better?", "A local laboratory known for stretching the boundaries of science is tackling a decidedly down-to-earth problem: how to design a better pair of underpants.", "Scientist and \"bio-hacker\" Andrew Pelling, who heads up the Pelling Lab at the University of Ottawa, is best known for figuring out how to grow human tissue on a slice of apple.", "His TED talk on the topic has surpassed 1.2 million views.", "<a href=\"https://www.cbc.ca/news/canada/british-columbia/andrew-pelling-ted-conference-1.3449084\" That caught the attention of Vancouver-based men's underwear company Saxx, and together they've embarked on a quest to build better gitch.", "Or is it gotch?", "Whatever you call it, Pelling immediately saw an opportunity.", "\"I'm always interested in new ideas and new collaborations that are not your typical academic thing.", "So this really caught my attention,\" Pelling said.", "Pelling and his colleagues began with a simple question: What will the underwear of the future look like?", "Is there a better fabric out there?", "One that's more sustainable, or maybe stain-proof?", "Can old underwear biodegrade, or maybe even be planted in the ground?", "Maybe the tighty-whities of the future will be neither tight nor white.", "Maybe they won't be made of fabric at all.", "Pelling even imagines a future where your boxers can tell if you're sick by detecting subtle changes in your microbes.", "\"This is where disruption comes from.", "Have we actually exhausted all of our design options, or are there new ideas out there?\"", "Pelling asked.", "But why is a serious scientist bothering with any of this?", "Why would a tenured professor with a lab named after him and the scientific world beating a path to his door want to design undies?", "Saxx is paying an undisclosed sum to the Pelling Lab as an \"ambassador partnership fee.\"", "The company is also handing $5 from the sale of each pair of limited-edition \"Augmented Reality\" boxer briefs, which use existing technology, over to the lab.", "But Pelling says there's more to it than the money.", "For him, it's also a chance to form fresh partnerships with people outside the scientific world who value ingenuity, and who \"spur on new ideas that might feed potential research programs later on.\"", "The world's first underwear hackathon will be held Jan. 18 at MakerLabs in East Vancouver, where artists, dancers, athletes, medical professionals and other scientists will help Pelling and the Saxx design team come up with the ultimate undies.", "\"Maybe there's some really interesting conversation that might happen by bringing together an unusual set of bedfellows to solve some interesting problems,\" Pelling said.", "But don't expect to see the underwear of the future any time soon.", "\"The road from hackathon prototype to a market-ready product is long.\""]