["Escalating costs at the Seaspan Shipyard in Vancouver in 2019 depleted the multi-million dollar contingency fund set aside as part of the budget to build three offshore fisheries science vessels under Canada's National Shipbuilding Strategy.", "The Canadian Coast Guard Ship Sir John Franklin and CCGS Capt.", "Jacques Cartier were delivered in 2019, and a third ship is expected this year.", "The 63-metre vessels are the first large civilian ships produced under the federal shipbuilding program.", "They will be used to monitor fish stocks and ecosystems.", "The $687-million budget included an escalation contingency fund.", "The amount was not disclosed.", "The full amount was redacted in a federal document authorizing the final dip into the fund.", "It was released to CBC News under access to information legislation.", "According to a memorandum prepared for Jonathan Wilkinson, the former minister of fisheries and oceans, the project had already used $19 million in contingency funds by May 2019.", "But more was needed, the memo said, to cover \"escalating project costs such as labour rates and owner's changes, as well as other unexpected increases to project costs including transition into service costs.\"", "\"Access to the remainder of the contingency funding [redacted] is now required,\" the two-page memo said.", "A decision was needed by July 5, 2019, the note said, \"in order to adjust the Shipbuilding Contract with Vancouver Shipyards in a timely fashion and further advance the project in a seamless manner.\"", "Wilkinson signed off on the request.", "The Department of Fisheries and Oceans would not disclose the amount, but said Wilkinson was not asked to approve new funding.", "\"The overall contingency fund is a small percentage of the overall budget of $687 million, and is a pre-planned funding amount to cover potential increases to labour rates at the shipyard, economic price and foreign exchange adjustments, and any necessary changes to operational requirements that surface over the 5-year project implementation phase,\" DFO spokesperson Benoit Mayrand said in a statement to CBC News.", "\"The total value of available contingency funding cannot be released, as its use will be subject to negotiations with the shipyard,\" he said.", "In an emailed statement, Seaspan spokesperson Amy MacLeod said \"requests for contingency funding is a normal, ongoing part of the contracting process on large projects such as the [National Shipbuilding Strategy].\"", "When the agreement in principle with Seaspan was announced in 2015, the total project budget was set at $687 million.", "Federal officials said at the time the total included $59 million for project management, work up to that date and contingencies, $51 million for engineering costs, and the remainder for construction, contingencies, insurance, warranty, spares and training material.", "Seaspan committed to deliver three offshore fisheries science vessels at a total ceiling price of $514 million.", "The ceiling included fees and an allowance for contingencies \"that may or may not be required to address the risks associated with building a new class of ships in what is essentially a brand new shipyard.\"", "The agreement set out three cost bands and established incentives to the yard if the final cost came in below target.", "If the final cost came in under a $400-million target, Canada would pay Seaspan a fee and the government and yard would share the savings between the actual and target costs.", "Delivery of the first vessel was scheduled for spring 2017, the second vessel five months later and the third three months later.", "The delivery date in every case was missed.", "Microscopic cracks in the welding were discovered on all three vessels in 2018.", "The faults were found after two of the ships had passed initial inspections.", "<a href=\"https://www.cbc.ca/news/politics/shipbuilding-coast-guard-welds-1.4788322\" target=\"_blank\" The original budget for the ships of $244 million was developed in 2004.", "During the 2015 briefing, federal officials said the first forecast was unrealistic because it did not adequately provide for inflation, management, engineering and design costs and did not properly include contingencies.", "<strong Reporter Paul Withers is an award-winning journalist whose career started in the 1970s as a cartoonist.", "He has been covering Nova Scotia politics for more than 20 years."]