["They came from across North America, paying $200 each to attend the ritzy event in Washington, D.C., hoping to snag selfies with some of the biggest names in the anti-vaccination movement.", "For the anti-vaccination activists gathered in the U.S. capital last November, it was also a chance to strategize on ways to further their cause.", "And they were more than willing to share those strategies with the undercover <em The <em \"Take vaccines out of the name — that way you won't get flagged,\" said one Virginian woman attending the event.", "She was speaking about how to get around social media filters geared at weeding out anti-vaccination content.", "<strong The woman also pointed to another popular tactic: Challenging vaccination policies under the seemingly libertarian banner of \"health freedom,\" \"medical freedom,\" or \"informed consent.\"", "Her own group is named Virginians for Informed Consent and has about 1,200 members.", "She's also gone a step further, making the group almost impossible for the public to find.", "\"We're secret,\" she said.", "\"You can't search our name [on Facebook].\"", "The VIP event attended by <em The movement persists despite a scientific consensus among medical professionals, vaccininologists and toxicologists that vaccines are safe and effective.", "\"Their goal is to create noise, to create uncertainty,\" said Timothy Caulfield, a health law and policy expert and author of <em \"Spreading misinformation will create chaos — and that's exactly what they've done.\"", "Non-medical exemptions from vaccines have spiked in recent years, as have outbreaks from vaccine-preventable diseases, <a href=\"https://www.nytimes.com/interactive/2019/health/measles-outbreak.html\" target=\"_blank\" In California, where exemption rates reportedly reached 10 per cent or more in some schools, lawmakers passed new laws <a href=\"https://www.forbes.com/sites/claryestes/2020/01/10/vaccination-rates-rise-in-california-after-personal-belief-exemptions-curbed/#98026ff7bb2e\" target=\"_blank\" Last year, Toronto Public Health <a href=\"https://www.cbc.ca/news/canada/toronto/toronto-public-health-calling-on-province-to-end-non-medical-exemptions-for-vaccines-in-schools-1.5285012\" target=\"_blank\" But it didn't come without protest: dozens of anti-vaccination activists showed up at city hall to fight that motion.", "\"People around the world have stopped vaccinating because of the rhetoric that they've read online, that they've had in discussion groups, about how vaccines may be harmful,\" said Dr. Vinita Dubey, of Toronto Public Health.", "\"At what point are we going to say: the exemption rates are too high, and we're putting the population at risk?\"", "In October, Vaccine Choice Canada, an anti-vaccination non-profit group, along with five Ontario mothers, <a href=\"https://www.cbc.ca/news/canada/toronto/child-vaccination-scheme-charter-challenge-1.5339169\" target=\"_blank\" The province previously told CBC it would not be considering an end to non-medical exemptions.", "A few months prior to the constitutional challenge in Ontario, when the government of New Brunswick introduced a bill that would have removed non-medical exemptions, anti-vaxxers gathered in Fredericton to push back against it.", "At the time, <a href=\"https://www.cbc.ca/news/canada/new-brunswick/mandatory-vaccination-hearings-1.5269118\" target=\"_blank\" Similar challenges have been launched at statehouses across the United States — most recently in New Jersey, where lawmakers <a href=\"https://www.nytimes.com/2020/01/16/nyregion/nj-vaccinations-religious-exemption.html\" target=\"_blank\" \"They would love to be able to predict what we have going on.", "They can't predict [it],\" James Lyons-Weiler, a well-known activist who runs a U.S. non-profit anti-vaxx group, said at the Washington event.", "\"Keep their heads spinning.\"", "Such tactics are \"incredibly craven,\" said Seth Mnookin, author of <em \"It's a dishonest way to go about things,\" he said.", "\"I think it shows there's an awareness if they try to have this debate in a real way, and try to present the facts and have honest discussions with parents and with legislators, that their side would lose.", "\"They don't have facts on their side, and they don't have science.\"", "<em Using hidden cameras, social media, court documents and tax returns, <em One man who knows a lot about those tactics is Andrew Wakefield, one of the world's most notorious anti-vaxxers, who attended the Washington event.", "The disgraced British ex-doctor famously helped spawn a generation of vaccine fear after co-authoring a 1998 study linking the MMR vaccine to autism.", "The study was <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(04)15699-7/fulltext\" target=\"_blank\" Wakefield also lost his medical licence, though he now has a career in the anti-vaccination movement.", "\"I love Canadians,\" said Wakefield when the undercover <em Saying they were hoping to have him speak at a future event in Vancouver, the team asked about Wakefield's speaking fee.", "<em \"I don't begrudge people to earn money to write and give speeches,\" said Mnookin.", "\"The part I find offensive is that it's money that's made off stoking people's fears and anxieties.", "I wish he wasn't making money off of falsehoods … he's apparently made a career out of this.\"", "According to tax filings, Wakefield brought in more than $3 million US to advance his debunked cause through non-profits and research over the past decade.", "A number of those non-profits have since been dissolved.", "Wakefield's lawyer, Jim Moody, confirmed his client has raised \"a few million\" dollars for the cause but said he is not a \"profiteer on this issue.\"", "Moody said the money was originally put toward research projects, but Wakefield has since pivoted, and \"most of his output now is in advocacy, film, written work and speeches, and not in published research papers.\"", "\"If he does know that it is a lie, this is a pretty evil pursuit,\" said Caulfield of Wakefield's ongoing anti-vaxx advocacy.", "\"If he doesn't know it's a lie, that he's somehow tricked himself into believing his nonsense, it shows an incredible ability to ignore the truth … it shows an incredible ability to allow harm to continue despite what the science says.\"", "Another leader of the movement is Del Bigtree, a former TV producer and controversial filmmaker who travels the world to host various speaking engagements and founded a non-profit called the Informed Consent Action Network (ICAN).", "He's also one of Wakefield's biggest defenders, working on a controversial documentary with him in 2016, and is often at the forefront of rallies protesting legislation that would limit vaccine exemptions.", "Bigtree grabbed headlines last year when <a href=\"https://www.washingtonpost.com/national/health-science/meet-the-new-york-couple-donating-millions-to-the-anti-vax-movement/2019/06/18/9d791bcc-8e28-11e9-b08e-cfd89bd36d4e_story.html\" target=\"_blank\" <strong When asked about Bigtree's speaking fees, his manager, James Sherrer, told an undercover <em \"It's worth it these days,\" he said.", "\"He's pretty in demand.\"", "Bigtree later told <em Other anti-vaxx figures, such as James Lyons-Weiler, find workarounds.", "Since 2015, Lyons-Weiler, has run a self-described \"progressive science\" group.", "He told <em \"I'm a not-for-profit — I'm just educating,\" he said at the VIP event.", "Yet in speeches, he touts the false claim that \"vaccines can and do cause autism\" and holds events at which he vows to \"bring the science.\"", "Earlier this month, he held an event in Los Angeles with another high-profile activist, Robert F. Kennedy Jr., where they charged $40 to $55 US per ticket.", "When asked how much it would cost to bring him to Canada to speak, Lyons-Weiler told the undercover <em \"So, what I would rather do is, I do a science day the day before,\" he said.", "\"I'd run an event where you ... charge admission as per my website.\"", "\"Sounds like a promo thing for you, a marketing thing for you,\" said our journalist.", "\"Now we've gotta quid pro quo.\"", "\"That's right,\" he said, later detailing through an assistant that for a group of 400 people, he would want about $20 US per person, netting around $10,000 Cdn.", "\"I think that there is a large majority of them ... [that] must be aware of the science.", "And this is a way of creating celebrity, this is a way of creating demand, this is a way of making a living,\" said Caulfield.", "Lyons-Weiler later told <em One activist at the Washington event recommended that <em \"It's almost kind of like, 'Ha ha, Amazon,'\" said the participant, referring to Amazon's attempts to remove anti-vaccination books and videos from its site.", "\"They're trying to restrict … free speech, but you're still donating to my vaccine charity.\"", "As part of its investigation, <em When asked about them, Amazon said organizations that support \"intolerance, hate, terrorism, violence, money laundering, or other illegal activities are not eligible.\"", "It said that if there are violations of this agreement, an organization's \"eligibility will be revoked.\"", "While online platforms, and social media, in particular, have become a primary tool in the anti-vaccination fight, companies — such as Facebook — have begun hiding (but not removing) such content from search results, <a href=\"https://www.buzzfeednews.com/article/ryanhatesthis/facebook-blocking-anti-vax-ads-reducing-newsfeed\" target=\"_blank\" Still, <em Most of the groups, such as the \"Oklahomans for Health and Parental Rights\" or \"Informed Choice Washington,\" were at the top of Facebook's search feeds.", "Those two groups combined had more than 25,000 followers.", "Groups such as Vaccine Choice Canada — a major Canadian anti-vaccination group — were also in the feed.", "And anti-vaccination leaders, such as Wakefield, Kennedy Jr. and Bigtree, were also searchable.", "Facebook has also been home to paid anti-vaccination advertising.", "Several media outlets <a href=\"https://www.washingtonpost.com/health/2019/11/15/majority-anti-vaccine-ads-facebook-were-funded-by-two-groups/\" target=\"_blank\" Though those ads have since been banned, the reach of that misinformation was widespread."]