["The death of University of Alberta engineering professors Pedram Mousavi and Mojgan Daneshmand is a great loss to science, say colleagues who are grappling with their grief.", "The Iranian-Canadian couple from Edmonton were killed when a Ukrainian passenger plane crashed minutes after takeoff from Tehran's international airport on Wednesday.", "Their two young daughters, Daria and Dorina Mousavi, also died in the crash.", "\"We miss them as colleagues,\" Ivan Fair, chair of the U of A's Department of Electrical and Computer Engineering, said Thursday.", "\"Several people in the department miss them as close friends.", "Their two daughters were friends with other people's children, and we mourn their loss.\"", "\"We will miss them both in the role that they had as supervisors,\" he said.", "\"We will miss them as people for what they contributed to our community.\"", "Mousavi and Daneshmand were electrical engineers and conducted research in wireless communications.", "They were members of the Institute of Electrical and Electronics Engineers Antennas and Propagation Society (IEEE AP-S), its president calling them \"superbly accomplished scholars.\"", "\"This is an incredible and immense loss to us as their friends and colleagues, as well as to the IEEE community as a whole,\" Mahta Moghaddam said in a written statement.", "\"We will miss their enthusiasm, high energy, and exceptional technical accomplishments, but more importantly, their extraordinary kindness and compassion.\"", "In 2016, Daneshmand was recognized for her scientific contribution in the field of microwave engineering and for being a role model for women in engineering, winning the prestigious IEEE AP-S Lot Shafai Distinguished Mid Career Award.", "\"She was an outstanding researcher,\" said Fair.", "\"And in that role, was able to be a mentor, to say, 'It doesn't matter what your gender is, if you have interests and initiative, just go for it.'\"", "While Daneshmand was a reserved person, Fair said, Mousavi had an outgoing personality.", "\"He would make sure he said hello with a wave to every person and always, always with a smile.\"", "They had both received a bachelor of science from the Iran University of Science &amp; Technology before moving to Canada to pursue their master's degrees at the University of Manitoba.", "Mousavi received his PhD from the University of Manitoba in 2001.", "Daneshmand completed her PhD at the University of Waterloo in 2006.", "Engineering and medicine are popular career choices in Iran for high-achieving students, according to Payman Parseyan, former president of Edmonton's Iranian Heritage Society.", "He said many students take advantage of the free post-secondary education offered in some parts of Iran to further their career prospects.", "\"There's also a lot more competition there for work.", "Higher competition means you need a higher level of education to compete in the workforce.\"", "The U of A's renowned Faculty of Engineering attracts Iranians who are pursuing that field, Parseyan said.", "\"Combining that with a country that disproportionately produces higher numbers of engineers than you would expect, there will be a synergy at some point,\" he said."]