["The Trudeau government has long characterized it as a dispassionate policy exercise drawing on expert evidence.", "But the political drumbeats are growing louder — at home and abroad — as the federal Liberals come closer to deciding whether to let a Chinese telecom firm help build Canada's next-generation mobile networks.", "The development of 5G, or fifth-generation, networks will give people speedier connections and provide vast data capacity to meet the ceaseless demand for emerging applications, like virtual reality and autonomous driving, as more and more things link to the internet.", "In Canada, China-based Huawei Technologies, Sweden's Ericsson and Finland's Nokia are among the leading candidates to help telecommunication firms such as BCE and Telus build their 5G networks.", "The opposition Conservatives are pressing the Liberals to deny Huawei a role in assembling the country's 5G infrastructure, alleging it will allow Beijing to spy on Canadians more easily.", "Some security experts say Huawei's participation could give it access to an array of digital data gleaned from how, when and where Canadian customers use their electronic devices.", "In turn, the theory goes, Chinese security agencies could pressure the company into handing over the personal information.", "Such fears stem from the fact China's National Intelligence Law plainly states that Chinese organizations and citizens shall support, assist and co-operate with state intelligence work.", "At a forum in Halifax last November, Donald Trump's national security adviser urged Ottawa to bar Huawei from 5G efforts because the technology would be used as a \"Trojan horse\" to undermine Canada.", "The warning came a day after China's ambassador to Canada, Cong Peiwu, dismissed the notion Huawei could compromise users' security by installing \"back-door\" channels in equipment, calling it a \"groundless accusation.\"", "Huawei emphasizes it is not a state-controlled enterprise and that it would never do the bidding of spymasters from China or any other country.", "Benjamin Howes, a Huawei Canada vice-president for international media affairs, notes the company's involvement in Canada's existing 4G networks has never led to any such security incident.", "He points to Huawei's $650-million investment in research and development in Canada since 2009, with major labs in Ottawa, Toronto, Waterloo, Ont., Montreal and Vancouver, as well as plans for one in Quebec City.", "\"In every country where we have a business presence, we're committed to complying with the applicable laws and regulations, and Canada is no different,\" Howes said.", "\"So we will continue to be compliant, as we have been over the decade that we've been here, with Canadian laws and regulations.\"", "Ottawa is carrying out a comprehensive review of Huawei's potential role in 5G that includes a broader, strategic look at how the technology can foster economic growth.", "Given the scope of the review, several agencies — Public Safety Canada, the Canadian Security Intelligence Service, the Communications Security Establishment, Global Affairs and Innovation, Science and Economic Development — are taking part.", "\"We will ensure that our networks are kept secure and will take the appropriate decisions in due course,\" said Scott Bardsley, a spokesman for Public Safety Minister Bill Blair.", "The government has been tight-lipped about the exercise, but the results are expected relatively soon.", "\"We respect the process, and we just hope that it's going to be based on technology and security, not politics,\" Howes said.", "However, the public debate already has been tinged by political developments.", "Canada arrested Meng Wanzhou, a senior Huawei executive, in December 2018 at the request of the United States, where she is wanted over allegations of violating sanctions on Iran.", "Her extradition case is before a Canadian court.", "The move angered Beijing and two Canadians working in China were arrested soon after on vague allegations of endangering national security — a move widely seen as retaliation against Ottawa.", "The U.S. and Australia, key intelligence allies of Canada, already have taken steps to curb Huawei's participation in 5G networks.", "Canada will be watching closely for Britain's coming decision on Huawei's participation in its 5G projects.", "If Boris Johnson's new government adopts the Australian and U.S. line, it could be more politically challenging for Canada to embrace Huawei.", "Ottawa's examination of 5G technology and the associated security and economic dimensions will include \"the careful consideration of our allies' advice,\" Bardsley said.", "For its part, Huawei insists it will remain committed to Canada, no matter how the 5G microchips fall.", "\"Regardless of the decision, our position is we will continue to serve our customers in Canada with our products and networks,\" Howes said."]