["Can a room full of sculptors in New York City help unlock the mysteries of remains found in British Columbia as far back as 1972?", "That's the hope of a first-time collaboration taking place this week at the New York Academy of Art, where artists in a forensic reconstruction workshop are trying to put a face on 15 3D-printed copies of skulls from the remains of unidentified men that were made available by the RCMP and BC Coroners Service.", "\"We're pretty sure that a lot of these [unidentified] people were not even from B.C., which is why we're so excited,\" said Laura Yazedjian, identification specialist with the BC Coroners Service.", "\"This will give exposure to people outside of B.C.", "to be able to see these [faces] and think historically about relatives and friends who were traveling or who never checked in.\"", "The academy pioneered the forensic reconstruction workshops in 2015 in partnership with New York's Office of the Chief Medical Examiner, in what has been called a unique merging of art and science.", "So far, the effort has led to the visual identification of four individuals.", "This year's is the sixth time the school has staged the workshop and the first time it is using skulls from Canada.", "The project is especially meaningful to academy graduate Adam Lupton who signed up for the workshop when he learned of the Canadian connection.", "\"The person [whose] skull I have is from West Vancouver.", "I grew up in Vancouver and North Vancouver,\" said Lupton.", "\"The person was homeless and I had an art gallery in the Downtown Eastside, so I interacted with and made friendships with people down there.\"", "The artists will spend five painstaking days learning how to read a skull and build out a face in clay that will be an approximation of what the person looked like when they were alive.", "\"Right now we're going through initial steps of laying down the muscles and then, on top of that, we're going to lay down a bit more of the tissue,\" he said.", "\"There's different markers that relate to different things — like how the ears might be slanted.\"", "There are currently 180 unidentified individuals whose remains were found in British Columbia and who continue to stump investigators.", "Yazedjian says the vast majority of the unidentified are male which is reflected in the samples sent to New York.", "She said the skulls selected were those in the best overall condition.", "Lupton says the experience has tugged at his emotions in a way he's not accustomed to in his everyday work.", "\"There is a responsibility that comes along with it knowing that this person's story is open ended right now,\" he said.", "\"So I feel very good about partaking in that and hoping to help and find some end to it.\""]