["A B.C.", "environmental group wants greater scrutiny of provincial conservation officers who kill bears and cougars while on the job.", "On Jan. 1, Pacific Wild sent an open letter to Environment Minister George Heyman calling on the government to make independent oversight a priority, and asking for all officers to be outfitted with body cameras while in the field.", "According to provincial statistics, the British Columbia Conservation Officer Service has killed 4,341 black bears and 162 grizzly bears in the past eight years.", "In 2019, 542 black bears and 26 grizzlies were killed.", "The letter comes after the ministry issued a media release on Dec. 20 in which Heyman is quoted saying no officer relishes the thought of having to put down an animal, which is always a last resort for public safety.", "\"The minister has stated in the press release that killing wildlife is always the last resort and that's categorically untrue,\" said Bryce Casavant, a spokesperson for Pacific Wild.", "<strong \"In many cases that's not the situation and wildlife is killed for other reasons such as officers' opinion or belief that the animal was unlikely to survive on its own,\" he said.", "Casavant, a former conservation officer who was suspended after refusing to kill two bear cubs in Port Hardy in 2015, said there is currently no review process when an officer discharges a service weapon and this should change.", "\"We need to ensure that our officers are accountable for discharging their service weapons in the course of their duties,\" he said.", "The letter asks for the Conservation Officer Service to make independent oversight a priority in 2020 and to have all field officers outfitted with body cameras no later than April 1.", "According to Annie Booth, ecosystems science and management professor at the University of Northern British Columbia, black bears have been responsible for 69 recorded fatalities in North America in the last 120 years \"compared to the large number killed by people.\"", "Booth said black bears are not very predatory and are lured into populated areas by fruit trees and garbage where they are killed as a last resort.", "\"There needs to be a lot more legislation and fines put around people who put out nuisance objects that attract bears into a difficult situation,\" said Booth.", "\"You really need to cut the problem at the source.\"", "Booth said it is difficult to second-guess the actions of conservation officers who are on the front lines, and she sees value in putting cameras on them.", "\"It provides the public with some assurances that a discharge of a firearm is being reviewed,\" said Booth, adding she would prefer to see the Conservation Officer Service establish clear standards that say when an officer can, or cannot, euthanize a bear.", "In a statement, the Ministry of Environment said conservation officers responded to more than 20,000 calls in 2019 related to conflicts with bears.", "The data does not include December because numbers for that month have yet to be calculated.", "<a href=\"https://www2.gov.bc.ca/assets/gov/environment/plants-animals-and-ecosystems/conservation-officer-service/predatorstatisticsblackbear.pdf\" target=\"_blank\" \"Conservation officers are dedicated to protecting and preserving wildlife and always consider all options before euthanizing an animal,\" said the ministry."]