["Cosiness is a necessity when winter lasts nearly half the year.", "Newfoundlanders and Labradorians have cosiness down to a science.", "If we had a word for it, like the Danish, we'd have it perfected.", "The Danish word \"hygge\" has no direct translation, but we know it well.", "You may see this word used to sell blankets and candles, but don't let its trendy status fool you.", "Hygge is something wonderful, and it pinpoints how to survive the winter.", "So what is it?", "Hygge refers to living a life of warmth and contentment.", "Cosiness is imperative.", "Low lighting sets the mood, hearty food staves off the cold.", "Host potlucks to feast with family and friends, and when the weather is nice, head outside.", "When it's nasty, curl up with a relaxing hobby.", "Sounds familiar, doesn't it?", "Here are some tips to help you maximize your hygge home.", "First, find all your beloved blankets, wool socks, knit sweaters, and favourite slippers.", "Now cocoon yourself.", "OK, maybe not all it at once, but you get it.", "If you find yourself lacking any of these items, it's OK.", "Your local artisan shop will have handmade quilts, socks and anything else you'll need to keep warm.", "Next, you'll want a warm drink.", "This could be anything: tea and coffee, cider, hot chocolate, mulled wine or whatever warms the cockles of your heart.", "Danish people prefer coffee.", "Though I'd imagine our love of a strong cup of orange pekoe could rival their obsession.", "If you're picking up a cup on your way home, chances are you already have a favourite coffee shop.", "If you'd rather make a cup at home, look for local product.", "Lots of companies here have the goods to warm your bones.", "No judgment if you add something a little stronger.", "Let me say this: if your home has a fireplace or wood stove, you're set.", "For everyone else, make friends with candles.", "Especially if they smell like a wood stove (other fragrances are acceptable too).", "Open flame isn't always convenient though.", "Owners of curious pets may prefer flameless candles or string lights (also known as fairy lights).", "These are also good for sensitive smoke alarms.", "They offer a warm glow without the fire hazard.", "If all else fails, use the lowest light you have available.", "A single lamp in a living room or hotel room will always be warmer than a bright overhead light.", "Now let's talk food.", "Think of this: a cosy meal with friends, in pretty well any local restaurant.", "That may seem too easy, but this province has some of the best food in the world.", "That goes for the high-end restaurants, and our favourite greasy spoons like Ches's or Mary Brown's.", "Whether you go out with friends or have food delivered to your blanket cocoon, a hot, delicious meal is imperative to hygge feelings.", "And speaking of friends… Spending time with friends is key.", "Consider meeting at restaurants and coffee shops, or hosting a potluck and game night.", "These are great ways to gather loved ones.", "Time spent with friends and family is like a hug — relaxing, warm, and welcoming.", "If you can't gather the gang, don't be afraid to head out on your own.", "Going to a restaurant or café alone doesn't have to be scary.", "Bring a book or a craft with you!", "You may meet a new friend who shares your interests, or just feel the comfort of being near people.", "Now, let's head outside!", "There's no shortage of outdoor activities in this province.", "Skating, skiing, and sledding are some of the most popular ways to enjoy the winter outdoors.", "For woodsy people, a snowshoe hike and a boil-up in the woods is a great way to get outside.", "Cook a good feed with some good people, or just make yourself a hot drink.", "Many city and provincial parks have the option of renting equipment, so don't worry if you don't own any gear.", "And of course, there's the best thing about going outside: that sweet, sweet feeling of coming back inside.", "A hobby that makes you feel warm and fuzzy inside is a must.", "Reading is a perfect choice.", "Local bookstores will always have hidden gems among the popular titles.", "If you can't get new books, consider the library!", "You can even borrow and read from your phone using <u If you'd rather keep your hands busy, then consider fibre arts.", "Knitting, crochet, and quilting are all ways to keep busy.", "Plus they build your hygge collection.", "Pro tip: if you knit or crochet a blanket, there will come a time where you can sit under it <em Maybe you prefer to make art, or music.", "Just make sure whatever you do brings you joy and relaxation."]