["Every January, along with the new year come scads of predictions about what lies ahead.", "This year, device fatigue is rampant, savvy consumers aren't swayed by novelty and the so-called \"techlash\" against big tech companies like Facebook and Google is in full force.", "And with climate change and increasing natural disasters, people are starting to question the carbon footprint of devices and data.", "Plus, 2020 isn't just \"any\" decade.", "We have officially entered \"the future,\" a fact made clear when you consider that some of the most well-known science fiction movies are now set in the past; the rainy, neon-lit dystopian world of <em So what does that mean for this year?", "Sure, there will be flashy wearables, new smartphone models and efforts to bring virtual reality mainstream.", "But the real innovations and trends to watch are the ones you might have to look a bit harder to see.", "Our smartphones don't seem to be going anywhere, but our relationship with them is clearly shifting.", "In the last few years, as much as people have talked about technological innovations, <a href=\"https://www.cbc.ca/radio/nowornever/how-to-have-a-healthier-relationship-with-your-phone-1.5338244\" Avery Swartz, author of the upcoming book <em Swartz predicts further changes to hardware and apps, along the lines of Instagram's ongoing <a href=\"https://www.cbc.ca/news/technology/instagram-like-counts-test-in-canada-1.5118501\" Madeline Ashby, a futurist and science fiction novelist, says that in addition to efforts to curb \"digital addiction\" like \"<a href=\"https://www.cbc.ca/news/canada/windsor/millenial-40-day-digital-detox-1.5102618\" Ashby calls this \"ethical consumption\" (noting the term could be contradictory), whereby consumers are making social and political choices with their purchases, or lack thereof.", "She says the trend will grow as the wealth gap expands and the effects of climate change increase.", "Indeed, in light of recurring climate catastrophes, there's a sharp and relatively sudden desire on the part of consumers to know more about the carbon footprint of their devices, says Katina Michael, a professor in the School for the Future of Innovation in Society at Arizona State University.", "Having witnessed koalas beg humans for water, the sky become red and the sand turn to black ash while returning home to the Australian bushfire crisis over the holidays, she says there is an urgent need for not only better emergency management processes, but also better sustainability practices.", "\"Nothing threatens innovation and progress like catastrophe, but nothing propels innovation quite like the loss of human or wildlife,\" Michael says.", "\"When we are without power, access to an automatic teller machine, mobile phone access, or even the internet, we become particularly innovative.\"", "As for what is (literally) on the horizon in the year ahead, many tech<strong Most satellites hover over the equator, and while \"that's great for TV,\" says Duncan Stewart, director of technology, media &amp; telecommunications research at Deloitte Canada, \"if you want to use a satellite for internet data, that's too far away, which means there will be lag.\"", "Satellites that are positioned closer to the earth have low latency, and constellations formed by hundreds of these LEO satellites are scheduled to have full service in parts of Canada by the end of the year, now that <a href=\"https://www.cbc.ca/news/canada/north/satellite-internet-inuvik-1.5277423\" Nuvujaq Inc. develops next generation satellite and \"edge\" computing networks.", "With edge computing, data storage and processing takes place closer to where it is being used or accessed, to reduce latency.", "Co-founder Madeline Redfern says that while LEO satellite networks enable high quality internet anywhere on the planet, to date there have been many questions about their financial and technological viability.", "She expects that the true potential of this technology will become more clear in 2020.", "\"In places like Nunavut, LEOs will allow us to do things that the rest of the country takes for granted,\" says Redfern.", "\"Videoconferencing will finally work, enabling friends and family to stay connected and potentially revolutionizing health and education services.\"", "In 2019, the surging international popularity of the Chinese social media app TikTok signalled a threat to Silicon Valley's supremacy.", "\"China is shaping the world order in its own image, and it is exporting its technologies and surveillance systems to other countries around the world,\" according to Amy Webb, a professor in the Stern School of Business at New York University and the founder and CEO of the Future Today Institute.", "China has talked openly about its plans for cyber sovereignty, which is to say, controlling all internet activity within its borders, and \"is quickly ascending to global supremacy,\" says Webb.", "Webb says that as China expands into African countries, Southeast Asia and Latin America, it will also begin to eschew operating systems, technologies and infrastructure built by the West.", "She says China has already announced that it will no longer use U.S.-made computers and software.", "All in all, 2020 is poised to be a big year for tech.", "But it probably won't be because of a killer app or a shiny new device.", "In fact, this year you'd be just as well skipping all of the fancy product launches and press releases.", "The most exciting stuff is harder to see, but could have lasting impact when it comes to how we relate to technology, to each other and to the world around us.", "Technology Columnist Ramona Pringle is an associate professor in Faculty of Communication and Design and director of the Creative Innovation Studio at Ryerson University.", "She is a CBC contributor who writes and reports on the relationship between people and technology."]