["4 Min Read TORONTO (Reuters) - The crash in Iran of a Ukrainian Airlines jet bound for Toronto killed dozens of professors and researchers from campuses across Canada, leaving a painful hole in Canadian academia where Iranians have taken on starring roles in engineering.", "“It is an unspeakable loss,” said Neda Maghbouleh, a sociology professor at the University of Toronto who studies Iranian migration through the United States and Canada.", "Four University of Toronto students were killed in the crash.", "“The people we lost in the plane truly represented the smartest young researchers in the entire world,” Maghbouleh said.", "Many of the dead were highly qualified Iranian-Canadians, some of whom had studied together at Tehran’s Sharif University.", "The number of Iranian international students in Canada more than doubled between 2016 and 2018, according to Canada’s immigration department.", "Many Iranians pursued graduate studies in Canada after the United States’ policy toward Iran hardened in 2017.", "The Ukrainian Airlines plane, which was headed to Toronto via Kiev, crashed shortly after takeoff from Tehran on Wednesday, killing all 176 people on board.", "The U.S. government believes Iran accidentally shot down the airliner, U.S. officials said on Thursday.", "Prime Minister Justin Trudeau said 138 passengers of the 176 on board the doomed flight were traveling to Canada, of whom 63 were Canadian citizens.", "Edmonton’s University of Alberta lost 10 faculty, postgraduate students and alumni, the school’s president said.", "Other victims were linked to universities in Quebec, Ontario, Nova Scotia and British Columbia.", "Canada has become a prime destination for Iran’s top engineering undergraduate students partly because it offers a path to citizenship for international students, said Concordia University engineering professor Ali Dolatabadi.", "He was the graduate supervisor for one of the victims, Siavash Ghafouri Azar.", "“I was the graduate program director in our department for seven years and I can easily say about half of our grad students are from Iran,” Dolatabadi said from Montreal.", "Among the dead were mentors and leaders in their fields, students and school administrators said.", "University of Alberta professor Mojgan Daneshmand was a Canada Research Chair in radio frequency microsystems.", "Others were researchers on hybrid electric vehicles, mechanical and computer engineering, and indigenous studies.", "Newlyweds Arash Pourzarabi, 26, and Pouneh Gorji, 25, were graduate students in computer science at the University of Alberta, and had gone to Iran for their wedding.", "Pourzarabi was a silver medalist in the National Olympiad in Informatics and the pair had been undergraduates in the prestigious Sharif University engineering program.", "“There’s an overwhelming sense of sadness on campuses right across the country from coast to coast,” said Paul Davidson, president of Universities Canada, an association representing 95 universities, in Ottawa."]