["5 Min Read SEOUL (Reuters) - In cram school-obsessed South Korea, students fork out for classes in everything from K-pop auditions to real estate deals.", "Now, top Korean firms are rolling out artificial intelligence in hiring - and jobseekers want to learn how to beat the bots.", "From his basement office in downtown Gangnam, careers consultant Park Seong-jung is among those in a growing business of offering lessons in handling recruitment screening by computers, not people.", "Video interviews using facial recognition technology to analyze character are key, according to Park.", "“Don’t force a smile with your lips,” he told students looking for work in a recent session, one of many he said he has conducted for hundreds of people.", "“Smile with your eyes.”   Classes in dealing with AI in hiring, now being used by major South Korean conglomerates like SK Innovation (<span id=\"”symbol_096770.KS_0”\" There’s good reason to see potential.", "As many as eight out of every 10 South Korean students are estimated to have used cram schools, and rampant youth unemployment in the country - nearly one in four young people are not in the workforce by certain measures, according to Statistics Korea - offers a motive not present in other countries where cram schools are popular, like Japan.", "“The AI won’t be naturally asking personal questions,” said Yoo Wan-jae, a 26-year-old looking for work in the hospitality industry.", "“That will make it a bit uncomfortable ... I’ll need to sign up for cram schools for the AI interview,” said Yoo, speaking in Seoul’s Noryangjin district, known as ‘Exam Village’, packed with cram schools and study rooms.", "Businesses around the world are experimenting with increasingly advanced AI techniques for whittling down applicant lists.", "But Lee Soo-young, a director of Korea Advanced Institute of Science and Technology (KAIST) Institute for Artificial Intelligence, told Reuters by telephone the new technology is being more widely embraced in South Korea, where large employers wield much influence in a tightening job market.", "According to Korea Economic Research Institute (KERI), nearly a quarter of the top 131 corporations in the country currently use or plan to use AI in hiring.", "One AI video system reviewed by Reuters asks candidates to introduce themselves, during which it spots and counts facial expressions including ‘fear’ and ‘joy’ and analyses word choices.", "It then asks questions that can be tough: “You are on a business trip with your boss and you spot him using the company (credit) card to buy himself a gift.", "What will you say?”  AI hiring also uses ‘gamification’ to gauge a candidate’s personality and adaptability by putting them through a sequence of tests.", "“Through gamification, employers can check 37 different capabilities of an applicant and how well the person fits into a position,” said Chris Jung, a chief manager of software firm Midas IT in Pangyo, a tech hub dubbed South Korea’s Silicon Valley.", "Preparing for such tests doesn’t necessarily involve simply memorizing answers.", "“Some games don’t even have a ‘right answer’, as they are aimed to spot the problem-solving attitude of the applicant,” Jung said.", "At People &amp; People, consultant Park said he gave AI hiring talks to over 700 university students, graduates and lecturers in 2019.", "“Students are struggling from the emergence of AI interviews.", "My goal is to help them be fully prepared for what they will be dealing with,” said Park.", "In an online chat room monitored by Park, with more than 600 participants, numerous messages indicate thanks for the classes and success in AI interview quests.", "But elsewhere, some who haven’t yet taken lessons have already given up.", "Kim Seok-wu, a 22-year-old senior at a top university, recently failed to get beyond an AI interview for a management position at a retail company, and decided to pursue graduate school instead of trying to find a job.", "“I think I will feel hopeless if all companies go AI for hiring,” Kim said."]