["4 Min Read MELBOURNE (Reuters) - The Melbourne skies were largely clear of bushfire smoke on Thursday as Australian Open organizers defended their decision to continue playing qualifiers during two days when a thick haze enveloped the city.", "Severe criticism has been leveled at Tennis Australia after qualifying for the first Grand Slam tournament of the season went ahead at Melbourne Park with minor disruptions despite the smoke.", "Slovenia’s Dalila Jakupovic was forced to retire after suffering a coughing fit in the second set of her match on Tuesday and several other players said they had found it difficult to breathe.", "Britain’s Liam Broady, who lost his first round qualifying match on Tuesday, said the decision to continue playing while Melbourne residents were being warned to keep pets indoors “boiled” his “blood”.", "“We can’t let this slide.", "The email we received yesterday from the ATP and AO was a slap in the face, conditions were ‘playable’.", "Were they healthy?” he posted in a note on Twitter.", "Australian Open tournament director and Tennis Australia chief Craig Tiley, however, told reporters that he was confident in the systems they had in place to protect the players from harm.", "“Our medical team were satisfied with the conditions that the players were competing in, per all of the research and the data and the science that they have,” Tiley said.", "“But they also make an assessment.", "You could have been two hours into those matches and have 25 people presenting themselves with a medical condition that may be related to the pollutants.", "“If that’s the case, inform me and we stop.”  Australia is experiencing one of its worst bushfire seasons on record with blazes killing 28 people, destroying more than 2,500 homes and razing forests and farmland over an area equivalent to the size of Bulgaria.", "The nation celebrated the first major rainstorms during that period on Wednesday night and qualifying got underway as scheduled on Thursday morning in temperatures more than 10 degrees Celsius cooler than on the previous two days.", "The negative feeling from some of the lowly-ranked players, for whom qualifying presents the opportunity to get into the main draw and make more money than they might earn in a year otherwise, had not gone away, however.", "“I pride myself on being one of the fittest players on the circuit I play and my body literally failed me on that day #Poor,” Broady’s compatriot Jay Clarke, another loser on Tuesday, posted on Twitter.", "Tennis Australia said earlier this week their decisions about whether conditions were fit for play were based on on-site data and in consultation with medical staff, weather forecasters and government scientists.", "“We understand the anger but a lot of it comes from the confusion and the complexity of understanding what goes on,” Tiley added.", "“We’ve invited the players ... to come in at any time to have a conversation.", "If anyone at any time is feeling not well, we have a full medical team.", "“We have a respiratory specialist on hand to deal with any of these issues.”  Australia’s Bureau of Meteorology forecast a maximum of 19 Celsius (66.2 Fahrenheit) for Melbourne on Thursday but temperatures are predicted to rise again at the weekend.", "The Australian Open runs from next Monday until Feb. 2."]