["3 Min Read BERLIN (Reuters) - German politicians and managers have set up an elite networking association to strengthen links to China at a time of tension over Hong Kong and a looming decision on whether to exclude Huawei from Germany’s 5G rollout.", "The organizers say the “China-Bridge” initiative is modeled on the “Atlantic-Bridge”, a non-profit organization set up in 1952 to boost German-American friendship which has 500 decision-makers in business, politics, science and media as members.", "China is a crucial business partner for export-oriented Germany.", "The two traded almost 100 billion euros in goods in the first half of last year.", "“China will be one of the global powers that shape this century.", "Germany needs a dialogue led by business, politicians and civil society,” Bavarian conservative politician Hans-Peter Friedrich, who will head the new body, told Reuters.", "Other members include Andreas Hube, a manager at software company SAP and the head of the Sino German Hi Tech Park Holding in Heidelberg, Mike De Vries.", "Those involved said the idea was not to tackle everyday political tussles but to create channels for dialogue between citizens and institutions of both countries.", "Friedrich also made clear the organization would not be uncritical of China.", "Relations with China have deepened significantly in the 14 years Angela Merkel has been chancellor of Europe’s biggest economy.", "She visits the country regularly and plans to make China a priority of Germany’s six-month presidency of the European Union in the second half of this year, culminating in an EU-China summit.", "Violent protests in Hong Kong overshadowed her trip to China in September where she, accompanied by a large business delegation, pressed Beijing to open up its markets.", "Her coalition will in the next few weeks or months decide on  security rules for Germany’s 5G network that could shut out China’s Huawei.", "The China-Bridge has already been registered as a non-profitable organization and is now seeking financial backing, for example from large companies."]