["4 Min Read DES MOINES, Iowa (Reuters) - Democratic presidential candidates Joe Biden and Pete Buttigieg will blitz Iowa before the state kicks off the party’s nominating contest on Feb. 3, while their key rivals will be largely unable to campaign because they must sit as Senate jurors in Republican President Donald Trump’s impeachment trial.", "Aides to Biden and Buttigieg, locked in a tight four-way battle with U.S.", "Senators Bernie Sanders and Elizabeth Warren, would not comment on the unprecedented advantage next week’s Senate trial presents them.", "Yet newly released schedules reveal an intense on-the-ground push by both candidates in the final stretch in Iowa, while Sanders, Warren and another senator, Amy Klobuchar, will miss most remaining campaign days to participate in the impeachment trial.", "“I would rather be in Iowa today,” Sanders told reporters at the U.S. Capitol on Tuesday after the trial formally kicked off.", "“I would rather be in New Hampshire and in Nevada and so forth.", "But I swore a constitutional oath as a United States senator to do my job, and I’m here to do my job.”   A senior aide to former Vice President Biden, speaking on the condition of anonymity, said the campaign has not recalibrated its Iowa strategy because of the Senate trial.", "But their No.", "1 priority is getting Biden talking to as many voters as possible in Iowa in the final days of what polls suggest is a virtual tie among the four.", "Biden heads to Iowa on Friday and will spend nearly every day between then and the Feb. 3 caucuses in the state, the aide said.", "Biden’s wife, Jill Biden, who has been campaigning heavily on behalf of her husband in Iowa and other early-voting states, will also spend much of the final 18 days in the state.", "Buttigieg’s campaign, meanwhile, announced a flurry of events with the candidate blanketing the state next week.", "On Monday alone, he will hold seven town hall events with voters, with an eighth on Tuesday.", "Entrepreneur Andrew Yang, who is not a leading contender in Iowa, nevertheless announced on Wednesday a 17-day bus tour throughout the state starting this weekend.", "To be sure, Sanders, Warren and Klobuchar are not ceding Iowa.", "They plan to campaign there during the final three weekends and will rely on representatives traveling the state for them on weekdays when the Senate trial is in session.", "Warren’s campaign has said they are considering remote appearances and events hosted by key supporters or family members.", "Sanders is weighing weekend trips and remote appearances at Iowa events.", "U.S. Congress members and fellow liberal firebrands Alexandria Ocasio-Cortez and Ilhan Omar are among the possible supporters Sanders may use in his place, his campaign has said.", "Klobuchar, who capped off a rise in the Iowa polls with another strong televised debate performance on Tuesday night, will also tap proxies such as her husband, she has said.", "The three senators also hope they might also get a visibility boost if the Senate impeachment proceedings are widely watched on national television.", "Dennis Goldford, an expert on Iowa’s caucuses at Drake University in Des Moines, said the three senators are at a disadvantage, though not a crippling one since they are well known.", "“But if there’s a feather on the scale, that can make a difference in a close race.", "This is a close race,” Goldford said.", "Tom Miller, Iowa’s attorney general who endorsed Biden this week, said he plans to campaign with Biden and hold his own events.", "The senators’ absence is “going to hinder them somewhat, but ... maybe people will work a little bit harder for them to make up for it,” he said."]