["5 Min Read BANGKOK (Reuters) - Thai office worker Pinyo Tongleun, 33, once participated in “Yellow Shirt” protests against then-Prime Minister Yingluck Shinawatra, who was eventually ousted in a military coup in 2014.", "But on Sunday, he joined more than 12,000 people in a “Run Against Dictatorship” to express frustration that the coup leader - ex-army chief Prayuth Chan-ocha, known by his nickname “Uncle Tu” - is still in power after disputed elections last year.", "“I am tired of Uncle Tu.", "And I want him to return democracy to the country,” Pinyo said at the run, held in a park in Bangkok.", "It was the largest show of dissent since the coup nearly six years ago.", "Some of the participants shouted “Prayuth, get out!” and “Long live democracy!” while jogging the 2.6-km (1.6-mile) course.", "They are a new breed of activist from the rival protesters who repeatedly paralyzed Bangkok for a decade before the military took over.", "They describe themselves simply as pro-democracy, in contrast to former “Red Shirt” and “Yellow Shirt” camps who were largely for and against ousted ex-Prime Minister Thaksin Shinawatra and later his sister, Yingluck.", "Many of those who ran on Sunday are supporters of the new Future Forward Party, founded by 41-year-old auto parts heir Thanathorn Juangroongruangkit.", "Some government supporters accused Thanathorn of orchestrating the event, an accusation that both Future Forward and the organizers denied - although Thanathorn did participate in the run.", "“We want democracy to return.", "This is the spirit of those who refused to be defeated by dictatorship,” Thanathorn told reporters as he arrived.", "Tanawat Wongchai, 21, the main organizer of the Run against Dictatorship, said that he is not a member of any particular political party.", "“Thais have bitter memories about political protests so we want to be creative in our activism against the government,” Tanawat said.", "A new round of street confrontations seems unlikely, at least in the short term.", "Leaders of the new movement say they want to avoid street protests but haven’t completely ruled out.", "COUP-MAKER IN CHARGE  In reality, the activists have few tools to actually oust Prayuth.", "The prime minister currently leads an unwieldy 18-party coalition government that has a slim but stable majority in the lower House of Representatives.", "The protesters are united mostly in being fed up with a military-dominated establishment that has sought to demonize any opposition - including laying criminal charges against Thanathorn and moving to disband Future Forward.", "Formed in 2018 as an alternative to established parties, Future Forward made a strong showing in the general election last March, coming in third by winning 6.2 million votes.", "It joined an opposition “democratic front” alliance aimed at undoing the legacy and grip of the military in politics.", "The “Run Against Dictatorship”, which in the Thai language was called “Run to Oust Uncle”, received clearance only after the original venue was rejected by authorities.", "Police also searched participants as they entered the park where it was held.", "A rival “Walk to Cheer the Uncle” event, held in another park, to show support for Prayuth, had little security presence.", "“Overall the situation does not reflect a progress in Thailand’s transition toward democracy in any way and shows that the government is firmly in control,” said Titipol Phakdeewanich, dean of political science at Ubon Ratchathani University.", "“NATION-HATERS”  While former Red Shirt pro-Thaksin supporters also participated in the “Run Against Dictatorship”, one of their leaders,  Jatuporn Prompan, said it was clear the focus of the opposition movement had shifted.", "“This is their time like it was our time 10 to 20 years ago.", "The Thanathorn phenomenon and the run to oust uncle is for the new generation,” Jatuporn said.", "Defenders of the government, meanwhile, have heightened rhetoric against the new democracy activists.", "Where Thaksin and his sister were decried as corrupt, both Thanathorn and his supporters are portrayed as seeking to destroy Thailand’s traditional culture, even the constitutional monarchy that is central to Thai identity - though no one at Sunday’s event spoke a word against the monarchy.", "Warong Dechgitvigrom, a member of the pro-government Action Coalition for Thailand Party, called the new breed of activists “nation-haters”.", "“My group will continue to tell people about the nation-haters because Thanathorn wants to change the country and topple the monarchy,” he said.", "He urged fellow Thais “to be vigilant and keep a close eye on our children”."]