["3 Min Read LONDON (Reuters) - Women who have sex at least once a month have a lower risk of entering menopause early than women with less active sex lives, scientists have found in research which they say points to a form of biological energy trade-off.", "A study of data from almost 3,000 women in the United States showed that those who said they had sexual activity weekly or more frequently - including intercourse, oral sex, sexual touching or self-stimulation - were 28% less likely to have experienced menopause at any given age than women who said they had sex less than once a month.", "“If a woman is not having sex, and there is no chance of pregnancy, then the body ‘chooses’ not to invest in ovulation, as it would be pointless,” said Megan Arnot, a PhD candidate at University College London (UCL) who co-led the research.", "She said the findings lend weight to the idea that the human menopause originally evolved to reduce reproductive conflict between generations of females, and to allow older women to increase their fitness through investing in their grandchildren.", "Women are more susceptible to disease during ovulation because their immune systems are depressed during this time.", "Arnot said the apparent “biological trade-off” is that it would be pointlessly costly to invest energy in the ovulation process if a women is having little or no sex and is hence unlikely to fall pregnant, so the body diverts energy resources into protecting and caring for existing offspring.", "“The menopause is, of course, an inevitability for women, and there is no behavioral intervention that will prevent reproductive cessation,” said Ruth Mace, a professor of anthropology at UCL who worked on the study with Arnot.", "“Nonetheless, these results are an initial indication that menopause timing may be adaptive in response to the likelihood of becoming pregnant,” she said  The research was published in the journal Royal Society Open Science and was based on data from the U.S. Study of Women’s Health Across the Nation, also known as the SWAN study."]