["4 Min Read TAIPEI (Reuters) - Hong Kong’s democracy protesters and politicians have hailed a sweeping election win by Taiwan’s President Tsai Ing-wen as a fillip for their movement that puts further pressure on China.", "Some who left the Asian financial hub after nearly seven months of often violent protests said they welcomed Tsai’s historic win with more than 8 million votes, exceeding the tally of any previous president.", "“A weight has been lifted off my shoulders,” said a Hong Kong protester in Taipei, who gave his name only as Roger and said he had feared being kicked out of Taiwan if its China-friendly opposition Kuomintang party swept to power.", "Authorities in Chinese-ruled Hong Kong have arrested more than 7,000 people, many on charges of rioting that can carry jail terms of up to 10 years.", "“I hope Hong Kong can be like Taiwan, that in the time of our next generation, Hong Kong will be a democratic and free place,” said Ventus Lau, one of the organizers of a 1,000- strong rally in Hong Kong against the Chinese Communist Party.", "“That’s why, in 2020, we need to fight autocracy together with the international community,” Lau said on Sunday.", "Some in the crowd waved black Hong Kong protest flags with the slogan, “Free Hong Kong.", "Revolution Now,” as Tsai delivered a victory speech to ecstatic supporters on Saturday.", "“I believe many democratic countries in the world, and many friends in Hong Kong, will feel happy about our collective decision,” Tsai said, drawing plaudits in Hong Kong’s online protester forums and groups on the Telegram messaging app.", "The slogan “Today Taiwan, Tomorrow Hong Kong” has sprung up after the landslide win, to express the hope that Hong Kong too will one day have full democracy.", "The former British colony returned to Chinese rule in 1997 amid promises it would be granted a high degree of autonomy and eventual universal suffrage.", "But China’s tightening grip on the city and Beijing’s failure to live up to its promises have fed the unrest, in one of the biggest popular challenges to the ruling Communist Party since the return.", "Many credit the protests with having helped to sway the Taiwan election in Tsai’s favor and deliver a rebuke to Beijing.", "Tsai’s government, which also won a parliamentary majority, owed Hong Kong more concrete support, said Roger Wong, a newly elected pro-democracy district councillor from the city who attended victory celebrations in Taipei.", "“I hope Taiwan can now speak up more for Hong Kong, especially the young people,” said Wong, 41, one of about 10 politicians who visited Taiwan for the election after a big win in November’s district polls.", "While Taiwan has discreetly extended tourist visas and offered special mid-year intakes for Hong Kong students at some universities, calls have grown to amend the law with special provisions for the territory.", "“This election is proof that Xi Jinping’s strategy of keeping Hong Kong and Taiwan under control is a total failure,” said Leung Man-to, a political science professor at the National Cheng Kung University in Tainan, referring to China’s leader."]