["5 Min Read SYDNEY (Reuters) - Three years ago, Australian Prime Minister Scott Morrison, then Treasurer, brandished a lump of coal in parliament as a totem of how the ruling conservative coalition planned to keep the lights on and power prices low.", "Now, with the country experiencing one of its worst ever bushfire seasons and facing criticism for his pro-coal policies, Morrison is acknowledging climate change is real.", "He is also talking about “adaptation” and “resilience”.", "“I think we want to have a high level of confidence that as a nation we are improving our resilience and our adaptation to respond to the reality of the environment in which we live,” Morrison told reporters in Canberra on Wednesday.", "Australia’s Science Minister Karen Andrews told the Sydney Morning Herald in an interview that climate denial was a waste of time, as she echoed Morrison’s “adaptation” mantra.", "As bushfires tore through New South Wales state in December, Morrison avoided drawing a link between the unusually early and ferocious fire season and climate change, saying the time was not right for such discussions.", "Just last week he said Sydney radio 2GB it was disappointing that people were conflating the bushfire crisis with Australia’s emission reduction targets.", "While the softening of his stance is significant, scepticism remains over whether it will translate to a stronger climate policy as large swathes of the country continue to burn.", "“It’s much overdue for the government to seriously engage on climate change adaptation,” said Frank Jotzo, a professor at the Australian National University’s Crawford School of Public Policy.", "“But what also needs to happen is for the Australian government to take a proactive stance on climate mitigation, that is, to reduce green house emissions.", "And there is still no clear signs that’s about to happen.”  Blazes burning since September have claimed the lives of 28 people, killed more than a billion animals and ripped through forests and farmland the size of Bulgaria.", "The hazy skies in Australia’s major cities have become a common occurrence, denting the country’s clean and green image, hurting tourism and consumer sentiment.", "The mood in the country is also changing.", "A poll from the Australia Institute on Wednesday showed the country’s bushfire crisis has intensified concerns about climate change with almost seven in 10 Australians wanting the government to lead on climate action.", "Morrison, whose popularity has sunk to its lowest levels since he took over leadership in 2018 over the government’s bushfire response, continues to espouse the merits of coal.", "“Our resources industry is incredibly important to Australia,” he reiterated on Wednesday, adding coal “is worth A$70 billion ($48.3 billion) to Australia and it is important to communities across the country.”  Mining jobs account for just under 2% of all employment in the country, miniscule in comparison with construction, retail, healthcare and tourism-related sectors.", "Morrison repeated his government will “meet and beat” a 26% global emissions reduction target agreed in Paris, “without putting taxes on people, putting up electricity prices and pulling out the rugs from regional communities who depend on the sector for their livelihoods.”  Academics and climate scientists say 26% is a lowball reductions target especially if as planned Australia uses its old carbon credits from the 1992 Kyoto Protocol - another sore point for activists.", "Australia’s reliance on coal-fired power makes it one of the world’s largest carbon emitters per capita and last year it approved a huge new coal mine by India’s Adani Enterprises.", "U.S. climatologist and geophysicist Michael Mann told Reuters that Morrison’s position was “ridiculous”.", "“If we continue to warm the planet, then we will in all likelihood exceed our adaptive capacity,” he said in an email.", "“In other words, there is no amount of adaptation that will allow Australians to contend with the impacts of climate change if we allow for a further escalation of the problem.”  In fact, Mann said, Australia could become so hot and dry that its residents could join the ranks of the world’s “climate refugees.”   ($1 = 1.4503 Australian dollars)  Reporting by Swati Pandey; Editing by Lincoln Feast."]