["3 Min Read SERGIYEV POSAD, Russia (Reuters) - When Alexei Voronenkov’s 70-year-old mother passed away, he paid to have her brain frozen and stored in the hope breakthroughs in science will one day be able to bring her back to life.", "It is one of 71 brains and human cadavers - which Russian company KrioRus calls its “patients” - floating in liquid nitrogen in one of several metres-tall vats in a corrugated metal shed outside Moscow.", "They are stored at -196 degrees Celsius (-320.8°F) with the aim of protecting them against deterioration, although there is currently no evidence science will be able to revive the dead.", "“I did this because we were very close and I think it is the only chance for us to meet in the future,” said Voronenkov who intends to undergo the procedure, known as cryonics, when he dies.", "The head of the Russian Academy of Sciences’s Pseudoscience Commission, Evgeny Alexandrov, described cryonics as “an exclusively commercial undertaking that does not have any scientific basis”, in comments to the Izvestia newspaper.", "It is “a fantasy speculating on people’s hopes of resurrection from the dead and dreams of eternal life”, the newspaper quoted him as saying.", "Valeriya Udalova, KrioRus’s director who got her dog frozen when it died in 2008, said it is likely that humankind will develop the technology to revive dead people in the future, but that there is no guarantee of such technology.", "KrioRus says hundreds of potential clients from nearly 20 countries have signed up for its after-death service.", "It costs $36,000 for a whole body and $15,000 for the brain alone for Russians, who earn average monthly salaries of $760, according to official statistics.", "Prices are slightly higher for non-Russians.", "The company says it is the only one in Russia and the surrounding region.", "Set up in 2005, it has at least two competitors in the United States, where the practice dates back further.", "Voronenkov said he set his hopes on science.", "“I hope one day it reaches a level when we can produce artificial bodies and organs to create an artificial body where my mother’s brain can be integrated.”  KrioRus’ director Udalova argues that those paying to have dying relatives’ remains preserved are showing how much they love them.", "“They try to bring hope,” she said.", "“What can we do for our dying relatives or the ones that we love?", "A nice burial, a photo album,” she said."]