["2 Min Read DUBAI (Reuters) - Iran has dropped spying charges against French-Iranian academic Fariba Adelkhah but the authorities are still detaining her on other security-related charges, her lawyer told Reuters on Tuesday.", "Iran has rejected France’s call to the release 60-year-old anthropologist, who has been detained since June, saying the demand was an interference in Tehran’s internal affairs because it does not recognize dual nationality.", "“Her spying charge was dropped by the court.", "But she still faces two to five years in jail for acting against national security and three months to one year for propaganda against the establishment,” lawyer Saeed Dehghan said by phone from Tehran.", "Dehghan said prosecutor had rejected a request for Adelkhah to be freed on bail but said she had been transferred from a section run by the Revolutionary Guards to a women’s section at Evin prison.", "Iran’s elite Revolutionary Guards have arrested dozens of dual nationals over recent years, mostly on espionage charges.", "France has demanded Iran release Adelkhah and her colleague Ronald Marchal, a senior researcher at Science-Po university whose arrest was reported by Paris in mid-October.", "The issue has complicated ties between the two countries during a period when French President Emmanuel Macron was seeking to defuse tensions between Washington and Tehran.", "“Marshal was never charged with spying.", "He faces the charge of acting against national security ... which means he can receive a two to five-year jail term,” Dehghan said, adding that Marchal was still held in the Guards section.", "Iran has stepped up detentions of foreign and dual nationals on spying and security charges during a protracted standoff with Western powers since the United States withdrew from an international agreement to curb Iranian nuclear activities.", "Rights activists have accused Iran of arresting a number of dual nationals to try to win concessions from other countries - a charge that the Islamic Republic has regularly dismissed."]