["4 Min Read NEW DELHI (Reuters) - New Delhi police are investigating how masked men burst into a leading university and attacked student protesters with sticks and rods, an officer said on Monday, the latest incident to ignite criticism of India’s ruling Hindu nationalists.", "Sunday’s attack at a university long seen as a bastion of left-wing politics comes as students nationwide lead a campaign against a citizenship law introduced last month by Prime Minister Narendra Modi that is seen as discriminating against Muslims.", "“Social media and CCTV footage will be part of the investigation,” said police official Devendra Arya, adding the violence at the university had prompted police to start a case.", "Students and some faculty of the Jawaharlal Nehru University have blamed the incident that injured at least 30 people on a students’ union tied to Modi’s Bharatiya Janata Party that has increasingly picked on the institution.", "Students put out pictures of mobs entering university residential halls, their faces covered with cloth, carrying sticks and even sledgehammers.", "Some shouted slogans, threatening death for traitors.", "Students said police had failed to act, leaving them at the mercy of the mob.", "Delhi police said they had launched an investigation.", "More than 30 people injured were admitted to the All-India Institute of Medical Science in the capital, a hospital official said, most of them with lacerations, cuts and bruises.", "The protests have persisted, with more demonstrations planned across India on Monday, prompted by the university attack.", "The Akhil Bharatiya Vidyarthi Parishad, the students’ wing of the BJP, denied accusations that it was behind the attack, which it blamed instead on rival leftist unions.", "Authorities faced criticism for failing to rein in the violence on a campus viewed a center of resistance to Modi’s policies, including the abolition last year of special status for Muslim-majority Kashmir.", "Amit Thorat, who teaches economics at JNU, said he called the police a little after 7 pm on Sunday but they didn’t come until an hour later.", "Nearly a dozen students Reuters spoke to said police watched as the mob rampaged inside the campus.", "“I...hang my head in shame after witnessing video clips of goons merrily entering JNU campus, creating mayhem and grievously injuring innocent students, damaging public property and then exiting the campus,” Rahul Mehra, a lawyer for the Delhi police, said on Twitter.", "Even medical teams trying to help the injured were attacked, said Harjit Bhatti, former president of the resident doctors’ association at the All India Institute of Medical Sciences.", "“Our team of doctors, nurses &amp; medical volunteers who reached JNU to give first aid to injured students &amp; teachers, was attacked by hundreds of goons,” he said in a tweet.", "“Mob manhandled doctors, nurses &amp; threatened them.", "Our ambulance’s glass &amp; windows broken, this is totally inhuman &amp; insane.”  Critics say the Modi administration is trying to crush dissent as it advances a Hindu-first agenda that undermines India’s foundations as a secular democracy.", "The citizenship law lays out a path for Indian nationality for minorities from six religious groups in neighboring countries but excludes Muslims.", "The government says the law is meant to tackle the grievances of minorities, such as Christians, Hindus and Sikhs, who face persecution in Afghanistan, Bangladesh and Pakistan."]