["4 Min Read MANILA (Reuters) - Schools and businesses shut across the Philippine capital on Monday as a volcano belched clouds of ash across the city and seismologists warned an eruption could happen at any time, potentially triggering a tsunami.", "Thousands of people were forced to evacuate their homes around Taal, one of the world’s smallest active volcanoes, which spewed ash for a second day from its crater in the middle of a lake about 70 km (45 miles) south of central Manila.", "“The speed of escalation of Taal’s volcanic activity caught us by surprise,” Maria Antonia Bornas, chief science research specialist at the Philippine Institute of Volcanology and Seismology, told reporters.", "“We have detected magma.", "It’s still deep, it hasn’t reached the surface.", "We still can expect a hazardous eruption any time.”  Authorities warned that an eruption could send a tsunami surging across the lake.", "More than 24,000 people have been evacuated from the volcanic island and the area immediately around it - normally a popular tourist spot.", "“We got scared of what could happen to us, we thought the volcano was going to erupt already,” said Marilou Baldonado, 53, who left the town of Laurel with only two sets of clothes after she saw the huge ash cloud build.", "Some tourists ignored the dangers and traveled to towns close to the volcano to get a better look.", "“It’s a once in a lifetime experience for us,” Israeli tourist Benny Borenstein told Reuters as he snapped photos of Taal from a vantage point in Tagaytay City, about 32 km away.", "To the southwest of the volcano, the towns of Agoncillo and Lemery were coated by a thick layer of ash, making roads impassable.", "Agoncillo’s mayor, Daniel Reyes, told DZMM radio some homes and part of a building had collapsed under the weight of the fallen ash.", "In nearby Talisay Batangas, Vice Governor Mark Leviste said rain had turned ash to mud and trucks were needed to evacuate more people from remote communities.", "“There is no power.", "Even water was cut, so we are in need of potable water,” he said.", "“We are in need of face masks.”  In Manila, masks sold out quickly after residents were advised to wear them if they had to go out.", "Some wore handkerchiefs across their faces as they breathed air tainted by the smell of sulfur.", "Streets that would normally be snarled with some of the world’s worst traffic were largely empty in the city of 13 million people.", "Schools and government offices were closed on official orders.", "The stock exchange suspended trading and many private businesses shut for the day too.", "Classes in some cities in the capital will remain suspended on Tuesday, officials said.", "Flight operations at Manila’s international airport partially resumed, authorities said, after more than 500 flights were delayed or canceled on Sunday.", "One flight that did land carried President Rodrigo Duterte, who was coming back from his home city of Davao in the southern Philippines.", "He had been unable to fly on Sunday because visibility was so low.", "One of the most active volcanoes in the Philippines, Taal has erupted more than 30 times in the past five centuries, most recently in 1977.", "An eruption in 1911 killed 1,500 people and one in 1754 lasted for a few months.", "The island has been showing signs of restiveness since early last year.", "The Philippines lies on the “Ring of Fire,” a belt of volcanoes circling the Pacific Ocean that is also prone to earthquakes."]