["22 Min Read LEBANON, Ohio (Reuters) - Something wasn’t right with the Rhino.", "Reports started trickling in to the Consumer Product Safety Commission (CPSC) in 2005 of people being killed or injured in the Yamaha Motor Co off-road vehicles when they tipped over.", "But no clear pattern emerged, and in the rough and tumble off-road world, accidents are common.", "The agency took no action.", "Then, in 2007, ten-year-old Ellie Sand was killed in a Rhino when it flipped in a cornfield in Warren County, Ohio.", "Her father, house painter John Sand, started reading up on other Rhino crashes.", "He spoke to other parents whose children had died or been seriously injured in similar incidents.", "He became convinced that Rhinos were the problem.", "Using a computer in a Cincinnati law library, Sand found more than a dozen lawsuits alleging that the vehicles were dangerously unstable.", "Some of the lawsuits – like the one he filed against the company in 2008 – claimed that design flaws caused the Rhinos to roll over even at slow speeds on flat ground.", "Sand sent the results of his research to CPSC, highlighting details from the lawsuits of the tip-overs that led to deaths and injuries.", "Soon after, CPSC sent a subpoena to Yamaha, forcing it to hand over a trove of information, much of which had lain hidden under judges’ protective orders in the lawsuits against the company.", "By then, more than 40 people, including more than a dozen children, had been killed in Rhino crashes.", "The impact of Sand’s work was confirmed in a voicemail message Sand received a few months later.", "Yamaha had agreed to a voluntary recall covering more than 100,000 Rhinos to fix the stability problems.", "“As a result of the information – a lot of the information that we received from you – we’ve gotten this far, so I wanted to thank you,” Marc Schoem, then deputy director of CPSC’s compliance and field operations, said in the March 31, 2009, message, which was reviewed by Reuters.", "Five years after the recall was announced, CPSC staff noted in a 2014 briefing that crashes involving the Rhino had “decreased noticeably.”  Sand told Reuters he “was elated that the work I’d done could help stop the carnage.” Still, he was surprised that it took an “average Joe” like him to flag the lawsuits to CPSC.", "A CPSC spokesman said that the agency had investigated Rhino incidents and that establishing a pattern that would have supported finding the vehicles defective proved challenging.", "Schoem declined to comment, as did Yamaha.", "CPSC is one of more than a dozen regulatory agencies tasked with protecting Americans from dangerous products.", "And the Rhino episode reveals a troubling dynamic in the way these watchdogs do their jobs: Sometimes the only way they can learn about and act on a possible threat to consumers is from evidence produced in lawsuits, but that evidence is often hidden behind a wall of secrecy.", "Most regulators have their own reporting systems for conducting oversight.", "But their databases can be vast and unwieldy, stuffed with thousands and even millions of consumer complaints and reports from manufacturers of safety concerns, injuries or deaths.", "The reports are often rife with mistakes and inconsistencies.", "Not all consumers even know they can file complaints.", "And companies regularly flout legally mandated reporting requirements.", "That leaves the courts as a conduit for alerting regulators to potential harm, and it’s far from perfect.", "As Reuters has documented in earlier articles in this series, a thick blanket of secrecy covers product-liability litigation in the United States.", "In just a handful of cases over the past several decades, hundreds of thousands of people were killed or injured by defective products – cars, drugs, guns – while information about the risks was hidden from consumers and regulators, sometimes for years, behind broad protective orders.", "These orders, though meant to protect specific information such as medical records and trade secrets, often give companies wide latitude to designate as confidential material exchanged between litigants in the pretrial discovery process – internal emails, data, research, meeting minutes, sworn depositions and the like.", "The secrecy typically persists for the life of the case, and long after, though court documents are, by law, presumed to be public.", "In an analysis of some of the largest mass defective-product cases consolidated in federal courts over the past 20 years, Reuters found 55 in which judges sealed information concerning public health and safety.", "And among those, only three had protective orders containing language specifically allowing information exchanged by the litigants to be shared with regulators.", "Regulators may subpoena information from a manufacturer after spotting a suspicious cluster of lawsuits, or after being alerted by a consumer like Sand in the Yamaha Rhino case.", "But those are rare exceptions.", "And regulators themselves aren’t inclined to mine court records as a means of oversight.", "In the 55 big cases Reuters reviewed, public court filings contained no indication that regulators had requested any information arising from the lawsuits.", "A few years ago, the National Highway Traffic Safety Administration (NHTSA) and CPSC issued pleas for easier access to evidence introduced in court under protective orders.", "But the Environmental Protection Agency, the Food and Drug Administration (FDA) and 15 other federal departments or agencies surveyed by Reuters did not point to any explicit policy or guidance on gaining access to court evidence potentially relevant to their oversight functions.", "Yet regulators have repeatedly documented the failures of existing safeguards.", "Since 2009, NHTSA and CPSC have fined a total of at least 90 companies for failing to meet safety-reporting requirements, while the FDA has issued more than a dozen warning letters to manufacturers of drugs and medical devices for similar lapses.", "Big business and its lobbyists contend that regulators have all the tools they need to do their jobs well – including the power to subpoena information subject to a judge’s protective order.", "“The protective order cannot block the government,” said Victor Schwartz, a partner at law firm Shook, Hardy &amp; Bacon LLP who has defended companies in civil litigation.", "“Litigation gets publicity.", "If the government sees something about a case … it can use its power, the subpoena power, to find out more detail,” he said.", "That argument, former U.S. regulatory officials said, doesn’t hold water when litigation is cloaked in secrecy.", "“It’s a catch-22,” said David Friedman, a former NHTSA official.", "If documents and other evidence in litigation are sealed, “how are you supposed to know about them?” Friedman said.", "“If you don’t know about them, you can’t get them.”  Friedman was at NHTSA during General Motors Co’s notorious 2014 recall of millions of cars with defective ignition switches, ultimately linked to 124 deaths and 275 injuries.", "A 2015 deferred prosecution agreement between GM and federal prosecutors showed the company scrambled for years to make sense of mounting reports of deaths and injuries while keeping regulators and the public in the dark about the switches, even after uncovering clear internal evidence they were defective.", "As early as 2003, NHTSA received complaints that Saturn Ions were stalling and, by 2004, that their airbags were failing to deploy in collisions.", "Similar complaints soon cropped up about Chevrolet Cobalts.", "In the ensuing years, the agency examined several fatal Cobalt crashes, each involving switches that slipped out of position and disabled airbags.", "Yet NHTSA didn’t make the connection between the switch problem and airbag failures.", "That was partly because its investigators misunderstood how GM’s airbag system operated, but also because NHTSA rules gave automakers a lot of leeway in how they reported certain information regarding safety risks.", "As a result, similar incidents were reported inconsistently.", "One was listed as an “engine and engine cooling” issue, for instance, while another as an “electrical” problem.", "That made it difficult for regulators to detect a pattern.", "From the first consumer complaints and incident reports, it would be more than 10 years and scores of deaths and injuries before NHTSA and the public learned of the link between defective ignition switches and airbag failures – and then only after evidence of what GM knew emerged in litigation and prompted the automaker to pursue a recall.", "In June 2011, the parents of Jennifer Brooke Melton filed a product-liability lawsuit against the company in a Georgia state court.", "Melton, a 29-year-old nurse, was killed in March 2010 when her Cobalt stalled on a rainy highway, crossed into oncoming traffic, collided with another vehicle and careened into a creek.", "The Melton case started, as many like it do, under a veil of secrecy.", "In December 2011, Judge Kathryn Tanksley approved a broad protective order, keeping from the public and NHTSA any documents that GM designated “in good faith” as confidential.", "Tanksley, now retired, said she approved the order because both the Meltons’ lawyer and GM agreed to the terms.", "“The role of litigation is not to regulate GM,” she said.", "When NHTSA officials want more information, she said, they “have to pursue it not through the court, but through their own power.”  The documents GM began turning over to Lance Cooper, the Meltons’ lawyer, were damning.", "They showed that in 2005, for example, a company engineer suggested a fix for less than $1 per vehicle, but it was rejected as too costly and not effective enough.", "Cooper also obtained evidence that the company modified the switches between 2005 and 2008 to keep them from slipping.", "The evidence built a strong case that GM had known for years that the switches were faulty.", "The Meltons were eager to go public with the evidence to prevent others from dying as their daughter had, but Cooper worried that if he challenged the protective order and regulators didn’t conclude the switches were defective, it would hurt their case.", "GM wanted to settle.", "“We thought that people needed to know.", "There were still people out there driving those cars,” Beth Melton told Reuters.", "“It’s a real shame that these things are kept secret and other people (suffer) because of it.”  Meanwhile, a Cobalt crash in Quebec, Canada, killed another driver.", "The airbags did not deploy.", "The ignition switch was later found to be in accessory mode, the position between on and off that could cut power to airbags.", "GM settled with the Meltons in September 2013 for $5 million.", "Five months later, after conducting its own investigation, GM recalled about 600,000 vehicles with the ignition switch.", "Cooper still wasn’t satisfied, based on what he had learned in the Melton lawsuit, and having obtained a settlement for his clients, he decided it was time to share evidence with NHTSA.", "“I basically said: ‘The hell with it,’ “ Cooper said.", "“If we can get this information to the federal government, they need it.", "Really, it was just a strategic decision to violate the protective order.”  In a letter to NHTSA , he suggested that the automaker knew about the defect far longer than its recall paperwork said and had not recalled enough vehicles.", "He urged the agency to investigate, citing evidence from the Melton case that he had seen as much as a year earlier.", "Eventually, NHTSA, Congress and federal prosecutors all investigated, relying heavily on evidence from the Melton case.", "GM increased the size of the recall, which eventually covered 2.6 million vehicles.", "In May 2014, NHTSA fined GM $35 million for failing to alert regulators to the defective ignition switch in a timely manner.", "The next year, GM entered into the deferred prosecution agreement with the U.S. Attorney’s Office for the Southern District of New York to settle criminal charges of concealing information from government officials and wire fraud.", "Under the deal, GM agreed to pay a $900 million fine and to submit to three years of oversight by an independent monitor.", "In 2018, a federal judge dismissed the charges against the company after prosecutors said the company had complied with the agreement.", "“The most damning information came out in litigation,” said Kevin Vincent, NHTSA’s head lawyer at the time.", "Though the facts eventually came to light, Vincent said, initial confidentiality in the Melton case “stymied” the agency.", "“That was evidence the agency needed to see,” he said.", "“We could have acted sooner.”  In a statement to Reuters, GM said: “Since 2014, we have undertaken comprehensive reforms across the company to ensure that something like the ignition switch crisis never happens again.” The company hired additional safety investigators, created a new executive position charged with overseeing global safety and recalls, and launched a program aimed at giving employees and dealers easier ways to flag potential vehicle defects.", "A NHTSA spokesman said the agency took 17 steps the U.S. Transportation Department inspector general recommended in the wake of the ignition-switch recall to improve collection and analysis of vehicle safety data.", "In 2016, NHTSA and CPSC, seeking to address what they acknowledge is a blind spot in their efforts to safeguard consumers, issued bulletins recommending that judges and litigants agree to protective orders that would allow them to share confidential evidence pertinent to public health and safety with the relevant regulators.", "“Our job is to protect consumers,” said Marietta Robinson, a CPSC commissioner at the time.", "“Obtaining information about an allegedly dangerous product from a lawyer representing a consumer who has been injured or killed is critically important to us doing that job.”  NHTSA’s bulletin, which cited the GM ignition-switch case, argued that keeping such information hidden from regulators clashes with federal legal requirements for courts to show “good cause” before allowing companies to keep it secret.", "But the bulletins, published in the Federal Register, where the government publishes new rules, proposals and public notices, carried no enforcement power, and they have had little impact.", "Judges have rarely shown willingness to grant requests from plaintiffs, expert witnesses or news organizations to share information with regulators or the public.", "Lawyers challenged defendants’ claims of confidentiality for material relating to public health and safety in 26 of the 55 big cases Reuters analyzed, and in most of them, judges refused to unseal the evidence.", "Some of those cases involved attempts to share information with the FDA.", "The FDA declined to comment on specific cases for this article.", "In general, the agency said, its powers to inspect drug makers’ plants and launch criminal investigations, along with voluntary reporting requirements for drug makers, “provide FDA with the tools to keep patients and consumers safe and fulfill its mission to protect and promote the public health.”  However, in the case of Pfizer Inc’s popular drug Chantix, which helps people quit smoking, court secrecy excluded possibly pertinent information from the agency’s process for assessing safety.", "The FDA approved Chantix in 2006.", "Three years later, it placed a black box warning – its strongest – on the drug’s label after receiving “reports of changes in behavior such as hostility, agitation, depressed mood, and suicidal thoughts or actions.”  Over time, Pfizer faced thousands of lawsuits blaming Chantix for such side effects.", "The company turned over millions of documents to plaintiffs under the condition they be kept confidential.", "In 2014, after Pfizer settled most of the cases for about $300 million, two plaintiff experts decided the FDA and the public should see internal Pfizer documents and expert reports that had been introduced in litigation.", "Through their lawyer, clinical psychiatrist Joseph Glenmullen and drug safety researcher Thomas Moore asked the judge overseeing the bulk of the Chantix litigation to unseal the information, which they said was important for “shedding light on Pfizer’s awareness of Chantix’s behavioral risks.”  Two days after their request was filed, U.S. District Judge Inge Johnson in Alabama rejected it.", "Her brief order did not address the substance of the request.", "Johnson did not respond to requests for comment.", "The upshot was that, two years later, an FDA advisory panel did not have access to all the information the two men had sought to make public as it considered a Pfizer request to remove the black box warning.", "Pfizer’s request was based on its own study claiming that Chantix did not have a significant association with depression and suicide.", "The advisory panel of medical experts in September 2016 recommended in a close vote to remove the black box warning.", "The FDA removed the black box warning a few months later.", "Chantix bottles still carry a less severe warning of potential mental health side effects.", "Moore acknowledged that it’s impossible to know whether the evidence he and Glenmullen sought to provide to regulators would have changed the panel’s decision.", "But he said he remains frustrated that information “central” to the question of Chantix’s safety never made it into regulators’ hands.", "“The FDA should be able to see it,” Moore said.", "Pfizer, in a statement to Reuters, said: “The FDA and its 2016 advisory panel had access to all of the data and science on Chantix, and all of the adverse events reports.” The plaintiff experts’ reports, the company noted, were not original science and instead reflected views of the underlying science that differed from the FDA and the advisory panel’s conclusions.", "Members of the FDA advisory panel Reuters contacted said they were unaware of Moore and Glenmullen’s efforts.", "One of them was Dr Jess Fiedorowicz, director of the University of Iowa Mood Disorders Center.", "He voted to remove the black box warning.", "He said he didn’t know whether the evidence from the two experts would have changed his mind, but, “I’m all for transparency in research.”  In September, House Judiciary Committee Chairman Jerrold Nadler, a New York Democrat, said he planned to reintroduce the Sunshine in Litigation Act to address the problem of court secrecy.", "The bill would allow parties in litigation to share evidence related to public health and safety with state and federal regulators, regardless of protective orders.", "Nadler’s pledge came during a hearing on courtroom transparency that was called after Reuters began publishing its series on court secrecy and its impact on public health and safety.", "Previous iterations of the bill introduced repeatedly since the early 1990s, despite enjoying bipartisan support, have ultimately failed in the face of sustained opposition from business groups that contend it would increase the costs and burdens of litigation for companies that are already meeting regulatory reporting requirements.", "However, as the Yamaha Rhino episode and others like it show, regulators and the public can’t assume manufacturers are meeting disclosure and reporting rules.", "A few months after John Sand sent a packet stuffed with his research to CPSC, the agency told Yamaha it had received information indicating that the Rhino could roll over at low speeds on flat ground, posing “an unreasonable risk of injury or death to riders.” It told the company to send it all relevant information, including documents from Rhino-related litigation.", "CPSC spent the next few months trying to get Yamaha to comply, at one point complaining to the company that it was sending “duplicative” material and that “the only new item seems to be a Model Year 2009 owner’s manual for the Rhino.”  Only after CPSC subpoenaed Yamaha did the company send to the agency a 70-page written response, a hard drive and 62 DVDs that contained all of the records the company had produced in years of litigation, including company documents that had been subject to protective orders.", "CPSC would have known about the Rhino much earlier if Yamaha hadn’t repeatedly violated the rules for notifying the agency of a possible defect, according to William Kitzes, a former adviser to the agency and an expert witness for plaintiffs in Rhino litigation who reviewed correspondence between the regulator and Yamaha.", "Companies must report to the agency immediately upon learning that a product is defective or can cause injury or death, or when a product is subject to three or more personal-injury lawsuits in a two-year period that are settled or decided in favor of plaintiffs.", "From 2004 to late 2008, Yamaha faced about 250 lawsuits alleging that Rhinos were unsafe.", "“Certainly no later than, and by many measures well before the end of 2005 ... Yamaha had adequate information to report,” Kitzes wrote in a report for plaintiffs.", "CPSC didn’t fine Yamaha for failure to report Rhino incidents.", "The agency and Yamaha jointly announced the Rhino recall on March 31, 2009 – referred to at the time, on Yamaha’s insistence, as a “free repair program.”  In 2011, the Ohio jury hearing Sand’s case found the Rhino defective, but awarded Sand no damages.", "Ellie was not wearing a helmet when she was killed, and the jury determined that she, her parents and others were negligent in her death.", "Yamaha stopped making the vehicles in 2013.", "Additional reporting by Erica Evans and Dan Levine.", "Edited by Janet Roberts and John Blanton."]