["3 Min Read SINGAPORE (Reuters) - Coastal nations around the Singapore Strait must step up surveillance and patrols of the strategic waterway after a sharp rise in piracy incidents last year, maritime watchdog ReCAAP said on Wednesday.", "The number of piracy and armed robbery incidents in the Strait jumped to 31 in 2019, up from seven in 2018 and the highest since 99 in 2015, the group said in a report.", "The incidents occurred amid a slight uptick in sea robberies across Asia with 82 total incidents, still the second-lowest since 2007.", "They were mainly minor cases of scrap metal theft although some did involve knives, machetes and, in one instance, a gun, the group said.", "“We would like to ask the littoral states - Singapore, Indonesia and Malaysia - to enhance the surveillance and control in the Singapore Strait because of this rapid increase of incidents,” ReCAAP executive director Masafumi Kuroki said.", "ReCAAP has received a number of enquiries from shipping firms expressing concern about the increase, Kuroki said.", "Military leaders from Singapore, Indonesia, Malaysia and Thailand will hold talks this week in the city-state to discuss the increase of sea robberies in the Strait and possible measures to disrupt such incidents, Singapore’s defense ministry said on Wednesday.", "Singapore’s Maritime Port Authority said it takes a “serious view” of the recent armed robbery incidents and has been broadcasting alerts to vessels to exercise vigilance when traveling along the Strait.", "Analysts are divided over whether the rise in incidents pose any threat to Singapore’s vital maritime industry.", "“The attacks have occurred against a variety of ships and cargoes suggesting that they are opportunistic rather than targeted,” said Ian Ralby, a maritime crime expert who works with both the United Nations and the U.S.-based think tank Atlantic Council.", "“Caution will be heightened and additional measures may be taken, but for geographic, economic and practical reasons, Singapore’s stature in maritime commerce will not be damaged.”   But Bilveer Singh, an associate professor at the National University of Singapore’s department of political science, called the rise “simply unbelievable” and said it comes at a bad time for Singapore’s maritime trade which is already suffering from the U.S.-China trade war and a global economic slowdown.", "For now, there has been a limited impact on the industry.", "“The cost to the shipping industry of these claims is fairly low,” said Jack Marriott-Smalley, regional underwriting director at Charles Taylor Mutual Management, an insurance services provider."]