["4 Min Read LONDON (Reuters) - Investment in Britain’s tech sector surged 44% to a record $13.2 billion pounds in 2019, accounting for a third of all European funding and exceeding the total in France and Germany combined, the UK government’s Digital Economy Council said on Wednesday.", "The UK was behind only the United States and China in the level of venture capital funding, and it saw strong growth whereas both of its bigger rivals saw declines, according to the research conducted by Tech Nation and Dealroom.co.", "On a city level, London joined San Francisco’s Bay Area, Beijing and New York at the top of the world’s most-funded locations, it said.", "Digital Minister Matt Warman said it was “fantastic to see Britain continues to be the best place in Europe to start and grow a tech business, with record-breaking investment and the creation of eight new billion-dollar companies last year.”  He said that while the country was in a good position, it could not afford to be complacent and had to ensure that government policy supported the sector.", "“On access to talent, we will have a different immigration policy over the coming years and that will be an important opportunity for us to show that Britain is still very much the  right place to start or grow a tech business,” he said in an interview.", "The Conservatives plan to introduce an “Australian-style” points-based immigration system, and have promised to reduce overall immigration numbers, especially among the less skilled.", "Under the new system, which will treat EU and non-EU citizens the same, most immigrants will need a job offer to come to Britain, but there will be special visa schemes for those who are leaders in fields such as science and technology or who will fill shortages in public services.", "Britain was striking the right balance between regulating the fast-growing tech sector, for example in developing polices to make the internet as safe as it could be, Warman said, while also remaining pro-investment.", "The research showed that companies headquartered in London raised $9.7 billion pounds of the total, and the amount of money invested in early-stage companies jumped to $5.1 billion in 2019, from $4 billion the year before.", "Tech investor Saul Klein, co-founder of venture capital firm LocalGlobal, said Britain’s success had been 20 years in the making, starting with the arrival of U.S. companies which had established an ecosystem that helped home-grown firms flourish.", "“When you look at the number of $1 billion companies - AKA ‘unicorns’ in Silicon Valley tech talk - London has 46 unicorns, Berlin has 12, Paris has 11,” he said.", "A unicorn is a privately held startup company valued at more than $1 billion.", "“In the last 10 years, Britain has consolidated its position through a combination of capital, talent and building these $1 billion companies.”  The eight British companies that reached unicorn status in 2019 were Rapyd, CMR Surgical, Babylon Health, Sumup, Trainline, Acuris, Checkout.com and OVO Energy, taking the total created in the UK to 77, twice the total in Germany and almost four times as many as Israel, the report said."]