["3 Min Read SYDNEY (Reuters) - As global temperatures soar, Australia could become so hot and dry that the country’s residents could become climate refugees, U.S. climatologist and geophysicist Michael Mann told Reuters.", "Australia is in the midst of one of its worst fire seasons on record, with bushfires burning since September and claiming the lives of 28 people, killing more than a billion animals and razing forests and farmland the size of Bulgaria.", "Some fires were so monstrous that they created their own weather pattern causing dry lightning and fire tornadoes as a three-year drought left woods tinder-dry.", "“It is conceivable that much of Australia simply becomes too hot and dry for human habitation,” said Mann, who is director of the Earth System Science Center at Pennsylvania State University.", "“In that case, yes, unfortunately we could well see Australians join the ranks of the world’s climate refugees.”  Climate refugees, or environmental migrants, are people forced to abandon their homes due to change in climate patterns or extreme weather events.", "Mann, the recipient of last year’s Tyler Prize for Environmental Achievement, is on a sabbatical in Australia where he is studying climate change.", "The co-founder of the award-winning science website RealClimate.org said the brown skies over Sydney in recent days was a result of human-caused climate change led by record heat and an unprecedented drought.", "The remarks resonate with his peers who published a review of 57 scientific papers suggesting clear links.", "Climate change has led to an increase in the frequency and severity of what scientists call “fire weather” - periods with a high fire risk due to some combination of higher temperatures, low humidity, low rainfall and strong winds, the review found.", "A poll from the Australian Institute published on Wednesday showed the bushfire crisis has intensified Australians’ concerns about climate change and its impact.", "And yet, Australian Prime Minister Scott Morrison and his conservative government have sought to downplay the role of manmade climate change in making the country vulnerable to fires.", "Morrison has repeatedly said his Centre-Right government would “meet and beat” a 26% global emissions reduction target agreed in Paris, albeit with a caveat that such goals should not come at the cost of jobs and the economy.", "Mann, the author of four books including “The Madhouse Effect,” said Australia could still “easily achieve” the target by shifting towards renewable energy.", "“It’s possible to grow the economy, create jobs, and preserve the environment at the same time.", "These are things that all Australians could embrace,” Mann said."]